NordicSemiconductor/nrfx/mdk/nrf54ls05b_enga_types.h
/* XOTUNEERROR @Bit 5 : Write '1' to disable interrupt for event XOTUNEERROR */
  #define CLOCK_INTENCLR_XOTUNEERROR_Pos (5UL)       /*!< Position of XOTUNEERROR field.                                       */
  #define CLOCK_INTENCLR_XOTUNEERROR_Msk (0x1UL << CLOCK_INTENCLR_XOTUNEERROR_Pos) /*!< Bit mask of XOTUNEERROR field.         */
  #define CLOCK_INTENCLR_XOTUNEERROR_Min (0x0UL)     /*!< Min enumerator value of XOTUNEERROR field.                           */
  #define CLOCK_INTENCLR_XOTUNEERROR_Max (0x1UL)     /*!< Max enumerator value of XOTUNEERROR field.                           */
  #define CLOCK_INTENCLR_XOTUNEERROR_Clear (0x1UL)   /*!< Disable                                                              */
  #define CLOCK_INTENCLR_XOTUNEERROR_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define CLOCK_INTENCLR_XOTUNEERROR_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* XOTUNEFAILED @Bit 6 : Write '1' to disable interrupt for event XOTUNEFAILED */
  #define CLOCK_INTENCLR_XOTUNEFAILED_Pos (6UL)      /*!< Position of XOTUNEFAILED field.                                      */
  #define CLOCK_INTENCLR_XOTUNEFAILED_Msk (0x1UL << CLOCK_INTENCLR_XOTUNEFAILED_Pos) /*!< Bit mask of XOTUNEFAILED field.      */
  #define CLOCK_INTENCLR_XOTUNEFAILED_Min (0x0UL)    /*!< Min enumerator value of XOTUNEFAILED field.                          */
  #define CLOCK_INTENCLR_XOTUNEFAILED_Max (0x1UL)    /*!< Max enumerator value of XOTUNEFAILED field.                          */
  #define CLOCK_INTENCLR_XOTUNEFAILED_Clear (0x1UL)  /*!< Disable                                                              */
  #define CLOCK_INTENCLR_XOTUNEFAILED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define CLOCK_INTENCLR_XOTUNEFAILED_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* CLOCK_INTPEND: Pending interrupts */
  #define CLOCK_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* XOSTARTED @Bit 0 : Read pending status of interrupt for event XOSTARTED */
  #define CLOCK_INTPEND_XOSTARTED_Pos (0UL)          /*!< Position of XOSTARTED field.                                         */
  #define CLOCK_INTPEND_XOSTARTED_Msk (0x1UL << CLOCK_INTPEND_XOSTARTED_Pos) /*!< Bit mask of XOSTARTED field.                 */
  #define CLOCK_INTPEND_XOSTARTED_Min (0x0UL)        /*!< Min enumerator value of XOSTARTED field.                             */
  #define CLOCK_INTPEND_XOSTARTED_Max (0x1UL)        /*!< Max enumerator value of XOSTARTED field.                             */
  #define CLOCK_INTPEND_XOSTARTED_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define CLOCK_INTPEND_XOSTARTED_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* PLLSTARTED @Bit 1 : Read pending status of interrupt for event PLLSTARTED */
  #define CLOCK_INTPEND_PLLSTARTED_Pos (1UL)         /*!< Position of PLLSTARTED field.                                        */
  #define CLOCK_INTPEND_PLLSTARTED_Msk (0x1UL << CLOCK_INTPEND_PLLSTARTED_Pos) /*!< Bit mask of PLLSTARTED field.              */
  #define CLOCK_INTPEND_PLLSTARTED_Min (0x0UL)       /*!< Min enumerator value of PLLSTARTED field.                            */
  #define CLOCK_INTPEND_PLLSTARTED_Max (0x1UL)       /*!< Max enumerator value of PLLSTARTED field.                            */
  #define CLOCK_INTPEND_PLLSTARTED_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define CLOCK_INTPEND_PLLSTARTED_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* LFCLKSTARTED @Bit 2 : Read pending status of interrupt for event LFCLKSTARTED */
  #define CLOCK_INTPEND_LFCLKSTARTED_Pos (2UL)       /*!< Position of LFCLKSTARTED field.                                      */
  #define CLOCK_INTPEND_LFCLKSTARTED_Msk (0x1UL << CLOCK_INTPEND_LFCLKSTARTED_Pos) /*!< Bit mask of LFCLKSTARTED field.        */
  #define CLOCK_INTPEND_LFCLKSTARTED_Min (0x0UL)     /*!< Min enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTPEND_LFCLKSTARTED_Max (0x1UL)     /*!< Max enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTPEND_LFCLKSTARTED_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define CLOCK_INTPEND_LFCLKSTARTED_Pending (0x1UL) /*!< Read: Pending                                                        */

/* DONE @Bit 3 : Read pending status of interrupt for event DONE */
  #define CLOCK_INTPEND_DONE_Pos (3UL)               /*!< Position of DONE field.                                              */
  #define CLOCK_INTPEND_DONE_Msk (0x1UL << CLOCK_INTPEND_DONE_Pos) /*!< Bit mask of DONE field.                                */
  #define CLOCK_INTPEND_DONE_Min (0x0UL)             /*!< Min enumerator value of DONE field.                                  */
  #define CLOCK_INTPEND_DONE_Max (0x1UL)             /*!< Max enumerator value of DONE field.                                  */
  #define CLOCK_INTPEND_DONE_NotPending (0x0UL)      /*!< Read: Not pending                                                    */
  #define CLOCK_INTPEND_DONE_Pending (0x1UL)         /*!< Read: Pending                                                        */

/* XOTUNED @Bit 4 : Read pending status of interrupt for event XOTUNED */
  #define CLOCK_INTPEND_XOTUNED_Pos (4UL)            /*!< Position of XOTUNED field.                                           */
  #define CLOCK_INTPEND_XOTUNED_Msk (0x1UL << CLOCK_INTPEND_XOTUNED_Pos) /*!< Bit mask of XOTUNED field.                       */
  #define CLOCK_INTPEND_XOTUNED_Min (0x0UL)          /*!< Min enumerator value of XOTUNED field.                               */
  #define CLOCK_INTPEND_XOTUNED_Max (0x1UL)          /*!< Max enumerator value of XOTUNED field.                               */
  #define CLOCK_INTPEND_XOTUNED_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define CLOCK_INTPEND_XOTUNED_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* XOTUNEERROR @Bit 5 : Read pending status of interrupt for event XOTUNEERROR */
  #define CLOCK_INTPEND_XOTUNEERROR_Pos (5UL)        /*!< Position of XOTUNEERROR field.                                       */
  #define CLOCK_INTPEND_XOTUNEERROR_Msk (0x1UL << CLOCK_INTPEND_XOTUNEERROR_Pos) /*!< Bit mask of XOTUNEERROR field.           */
  #define CLOCK_INTPEND_XOTUNEERROR_Min (0x0UL)      /*!< Min enumerator value of XOTUNEERROR field.                           */
  #define CLOCK_INTPEND_XOTUNEERROR_Max (0x1UL)      /*!< Max enumerator value of XOTUNEERROR field.                           */
  #define CLOCK_INTPEND_XOTUNEERROR_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define CLOCK_INTPEND_XOTUNEERROR_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* XOTUNEFAILED @Bit 6 : Read pending status of interrupt for event XOTUNEFAILED */
  #define CLOCK_INTPEND_XOTUNEFAILED_Pos (6UL)       /*!< Position of XOTUNEFAILED field.                                      */
  #define CLOCK_INTPEND_XOTUNEFAILED_Msk (0x1UL << CLOCK_INTPEND_XOTUNEFAILED_Pos) /*!< Bit mask of XOTUNEFAILED field.        */
  #define CLOCK_INTPEND_XOTUNEFAILED_Min (0x0UL)     /*!< Min enumerator value of XOTUNEFAILED field.                          */
  #define CLOCK_INTPEND_XOTUNEFAILED_Max (0x1UL)     /*!< Max enumerator value of XOTUNEFAILED field.                          */
  #define CLOCK_INTPEND_XOTUNEFAILED_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define CLOCK_INTPEND_XOTUNEFAILED_Pending (0x1UL) /*!< Read: Pending                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           CPUC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct CPUC ======================================================= */
/**
  * @brief CPU control
  */
  typedef struct {                                   /*!< CPUC Structure                                                       */
    __IM uint32_t RESERVED[320];
    __IOM uint32_t LOCK;                             /*!< (@ 0x00000500) Register to lock the certain parts of the CPU from
                                                                         being modified.*/
    __IM uint32_t CPUID;                             /*!< (@ 0x00000504) The identifier for the CPU in this subsystem.         */
  } NRF_CPUC_Type;                                   /*!< Size = 1288 (0x508)                                                  */

