NordicSemiconductor/nrfx/mdk/nrf54ls05b_enga_types.h
/* CPUC_LOCK: Register to lock the certain parts of the CPU from being modified. */
  #define CPUC_LOCK_ResetValue (0x00000000UL)        /*!< Reset value of LOCK register.                                        */

/* LOCKVTORAIRCRS @Bit 0 : Locks both the Vector table Offset Register (VTOR) and Application Interrupt and Reset Control
                           Register (AIRCR) for secure mode. */

  #define CPUC_LOCK_LOCKVTORAIRCRS_Pos (0UL)         /*!< Position of LOCKVTORAIRCRS field.                                    */
  #define CPUC_LOCK_LOCKVTORAIRCRS_Msk (0x1UL << CPUC_LOCK_LOCKVTORAIRCRS_Pos) /*!< Bit mask of LOCKVTORAIRCRS field.          */
  #define CPUC_LOCK_LOCKVTORAIRCRS_Min (0x0UL)       /*!< Min enumerator value of LOCKVTORAIRCRS field.                        */
  #define CPUC_LOCK_LOCKVTORAIRCRS_Max (0x1UL)       /*!< Max enumerator value of LOCKVTORAIRCRS field.                        */
  #define CPUC_LOCK_LOCKVTORAIRCRS_NotLocked (0x0UL) /*!< Both VTOR and AIRCR can be changed.                                  */
  #define CPUC_LOCK_LOCKVTORAIRCRS_Locked (0x1UL)    /*!< Prevents changes to both VTOR and AIRCR.                             */

/* LOCKVTORNS @Bit 1 : Locks the Vector table Offset Register (VTOR) for non-secure mode. */
  #define CPUC_LOCK_LOCKVTORNS_Pos (1UL)             /*!< Position of LOCKVTORNS field.                                        */
  #define CPUC_LOCK_LOCKVTORNS_Msk (0x1UL << CPUC_LOCK_LOCKVTORNS_Pos) /*!< Bit mask of LOCKVTORNS field.                      */
  #define CPUC_LOCK_LOCKVTORNS_Min (0x0UL)           /*!< Min enumerator value of LOCKVTORNS field.                            */
  #define CPUC_LOCK_LOCKVTORNS_Max (0x1UL)           /*!< Max enumerator value of LOCKVTORNS field.                            */
  #define CPUC_LOCK_LOCKVTORNS_NotLocked (0x0UL)     /*!< VTOR can be changed.                                                 */
  #define CPUC_LOCK_LOCKVTORNS_Locked (0x1UL)        /*!< Prevents changes to VTOR.                                            */

/* LOCKMPUS @Bit 2 : Locks the Memory Protection Unit (MPU) for secure mode. */
  #define CPUC_LOCK_LOCKMPUS_Pos (2UL)               /*!< Position of LOCKMPUS field.                                          */
  #define CPUC_LOCK_LOCKMPUS_Msk (0x1UL << CPUC_LOCK_LOCKMPUS_Pos) /*!< Bit mask of LOCKMPUS field.                            */
  #define CPUC_LOCK_LOCKMPUS_Min (0x0UL)             /*!< Min enumerator value of LOCKMPUS field.                              */
  #define CPUC_LOCK_LOCKMPUS_Max (0x1UL)             /*!< Max enumerator value of LOCKMPUS field.                              */
  #define CPUC_LOCK_LOCKMPUS_NotLocked (0x0UL)       /*!< MPU registers can be changed.                                        */
  #define CPUC_LOCK_LOCKMPUS_Locked (0x1UL)          /*!< Prevents changes to MPU registers.                                   */

/* LOCKMPUNS @Bit 3 : Locks the Memory Protection Unit (MPU) for non secure mode. */
  #define CPUC_LOCK_LOCKMPUNS_Pos (3UL)              /*!< Position of LOCKMPUNS field.                                         */
  #define CPUC_LOCK_LOCKMPUNS_Msk (0x1UL << CPUC_LOCK_LOCKMPUNS_Pos) /*!< Bit mask of LOCKMPUNS field.                         */
  #define CPUC_LOCK_LOCKMPUNS_Min (0x0UL)            /*!< Min enumerator value of LOCKMPUNS field.                             */
  #define CPUC_LOCK_LOCKMPUNS_Max (0x1UL)            /*!< Max enumerator value of LOCKMPUNS field.                             */
  #define CPUC_LOCK_LOCKMPUNS_NotLocked (0x0UL)      /*!< MPU registers can be changed.                                        */
  #define CPUC_LOCK_LOCKMPUNS_Locked (0x1UL)         /*!< Prevents changes to MPU registers.                                   */

/* LOCKSAU @Bit 4 : Locks the Security Attribution Unit (SAU) */
  #define CPUC_LOCK_LOCKSAU_Pos (4UL)                /*!< Position of LOCKSAU field.                                           */
  #define CPUC_LOCK_LOCKSAU_Msk (0x1UL << CPUC_LOCK_LOCKSAU_Pos) /*!< Bit mask of LOCKSAU field.                               */
  #define CPUC_LOCK_LOCKSAU_Min (0x0UL)              /*!< Min enumerator value of LOCKSAU field.                               */
  #define CPUC_LOCK_LOCKSAU_Max (0x1UL)              /*!< Max enumerator value of LOCKSAU field.                               */
  #define CPUC_LOCK_LOCKSAU_NotLocked (0x0UL)        /*!< SAU registers can be changed.                                        */
  #define CPUC_LOCK_LOCKSAU_Locked (0x1UL)           /*!< Prevents changes to SAU registers.                                   */


/* CPUC_CPUID: The identifier for the CPU in this subsystem. */
  #define CPUC_CPUID_ResetValue (0x00000000UL)       /*!< Reset value of CPUID register.                                       */

/* CPUID @Bits 0..31 : The CPU identifier. */
  #define CPUC_CPUID_CPUID_Pos (0UL)                 /*!< Position of CPUID field.                                             */
  #define CPUC_CPUID_CPUID_Msk (0xFFFFFFFFUL << CPUC_CPUID_CPUID_Pos) /*!< Bit mask of CPUID field.                            */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        CTRLAPPERI                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct CTRLAPPERI_MAILBOX ================================================ */
/**
  * @brief MAILBOX [CTRLAPPERI_MAILBOX] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RXDATA;                            /*!< (@ 0x00000000) Data sent from the debugger to the CPU.               */
  __IM  uint32_t  RXSTATUS;                          /*!< (@ 0x00000004) Status to indicate if data sent from the debugger to
                                                                         the CPU has been read.*/
  __IM  uint32_t  RESERVED[30];
  __IOM uint32_t  TXDATA;                            /*!< (@ 0x00000080) Data sent from the CPU to the debugger.               */
  __IM  uint32_t  TXSTATUS;                          /*!< (@ 0x00000084) Status to indicate if data sent from the CPU to the
                                                                         debugger has been read.*/
} NRF_CTRLAPPERI_MAILBOX_Type;                       /*!< Size = 136 (0x088)                                                   */

