NordicSemiconductor/nrfx/mdk/nrf54ls05b_enga_types.h
/* PIN4 @Bit 4 : Pin 4 */
  #define GPIO_OUT_PIN4_Pos (4UL)                    /*!< Position of PIN4 field.                                              */
  #define GPIO_OUT_PIN4_Msk (0x1UL << GPIO_OUT_PIN4_Pos) /*!< Bit mask of PIN4 field.                                          */
  #define GPIO_OUT_PIN4_Min (0x0UL)                  /*!< Min enumerator value of PIN4 field.                                  */
  #define GPIO_OUT_PIN4_Max (0x1UL)                  /*!< Max enumerator value of PIN4 field.                                  */
  #define GPIO_OUT_PIN4_Low (0x0UL)                  /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN4_High (0x1UL)                 /*!< Pin driver is high                                                   */

/* PIN5 @Bit 5 : Pin 5 */
  #define GPIO_OUT_PIN5_Pos (5UL)                    /*!< Position of PIN5 field.                                              */
  #define GPIO_OUT_PIN5_Msk (0x1UL << GPIO_OUT_PIN5_Pos) /*!< Bit mask of PIN5 field.                                          */
  #define GPIO_OUT_PIN5_Min (0x0UL)                  /*!< Min enumerator value of PIN5 field.                                  */
  #define GPIO_OUT_PIN5_Max (0x1UL)                  /*!< Max enumerator value of PIN5 field.                                  */
  #define GPIO_OUT_PIN5_Low (0x0UL)                  /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN5_High (0x1UL)                 /*!< Pin driver is high                                                   */

/* PIN6 @Bit 6 : Pin 6 */
  #define GPIO_OUT_PIN6_Pos (6UL)                    /*!< Position of PIN6 field.                                              */
  #define GPIO_OUT_PIN6_Msk (0x1UL << GPIO_OUT_PIN6_Pos) /*!< Bit mask of PIN6 field.                                          */
  #define GPIO_OUT_PIN6_Min (0x0UL)                  /*!< Min enumerator value of PIN6 field.                                  */
  #define GPIO_OUT_PIN6_Max (0x1UL)                  /*!< Max enumerator value of PIN6 field.                                  */
  #define GPIO_OUT_PIN6_Low (0x0UL)                  /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN6_High (0x1UL)                 /*!< Pin driver is high                                                   */

/* PIN7 @Bit 7 : Pin 7 */
  #define GPIO_OUT_PIN7_Pos (7UL)                    /*!< Position of PIN7 field.                                              */
  #define GPIO_OUT_PIN7_Msk (0x1UL << GPIO_OUT_PIN7_Pos) /*!< Bit mask of PIN7 field.                                          */
  #define GPIO_OUT_PIN7_Min (0x0UL)                  /*!< Min enumerator value of PIN7 field.                                  */
  #define GPIO_OUT_PIN7_Max (0x1UL)                  /*!< Max enumerator value of PIN7 field.                                  */
  #define GPIO_OUT_PIN7_Low (0x0UL)                  /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN7_High (0x1UL)                 /*!< Pin driver is high                                                   */

/* PIN8 @Bit 8 : Pin 8 */
  #define GPIO_OUT_PIN8_Pos (8UL)                    /*!< Position of PIN8 field.                                              */
  #define GPIO_OUT_PIN8_Msk (0x1UL << GPIO_OUT_PIN8_Pos) /*!< Bit mask of PIN8 field.                                          */
  #define GPIO_OUT_PIN8_Min (0x0UL)                  /*!< Min enumerator value of PIN8 field.                                  */
  #define GPIO_OUT_PIN8_Max (0x1UL)                  /*!< Max enumerator value of PIN8 field.                                  */
  #define GPIO_OUT_PIN8_Low (0x0UL)                  /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN8_High (0x1UL)                 /*!< Pin driver is high                                                   */

/* PIN9 @Bit 9 : Pin 9 */
  #define GPIO_OUT_PIN9_Pos (9UL)                    /*!< Position of PIN9 field.                                              */
  #define GPIO_OUT_PIN9_Msk (0x1UL << GPIO_OUT_PIN9_Pos) /*!< Bit mask of PIN9 field.                                          */
  #define GPIO_OUT_PIN9_Min (0x0UL)                  /*!< Min enumerator value of PIN9 field.                                  */
  #define GPIO_OUT_PIN9_Max (0x1UL)                  /*!< Max enumerator value of PIN9 field.                                  */
  #define GPIO_OUT_PIN9_Low (0x0UL)                  /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN9_High (0x1UL)                 /*!< Pin driver is high                                                   */

/* PIN10 @Bit 10 : Pin 10 */
  #define GPIO_OUT_PIN10_Pos (10UL)                  /*!< Position of PIN10 field.                                             */
  #define GPIO_OUT_PIN10_Msk (0x1UL << GPIO_OUT_PIN10_Pos) /*!< Bit mask of PIN10 field.                                       */
  #define GPIO_OUT_PIN10_Min (0x0UL)                 /*!< Min enumerator value of PIN10 field.                                 */
  #define GPIO_OUT_PIN10_Max (0x1UL)                 /*!< Max enumerator value of PIN10 field.                                 */
  #define GPIO_OUT_PIN10_Low (0x0UL)                 /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN10_High (0x1UL)                /*!< Pin driver is high                                                   */

/* PIN11 @Bit 11 : Pin 11 */
  #define GPIO_OUT_PIN11_Pos (11UL)                  /*!< Position of PIN11 field.                                             */
  #define GPIO_OUT_PIN11_Msk (0x1UL << GPIO_OUT_PIN11_Pos) /*!< Bit mask of PIN11 field.                                       */
  #define GPIO_OUT_PIN11_Min (0x0UL)                 /*!< Min enumerator value of PIN11 field.                                 */
  #define GPIO_OUT_PIN11_Max (0x1UL)                 /*!< Max enumerator value of PIN11 field.                                 */
  #define GPIO_OUT_PIN11_Low (0x0UL)                 /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN11_High (0x1UL)                /*!< Pin driver is high                                                   */

/* PIN12 @Bit 12 : Pin 12 */
  #define GPIO_OUT_PIN12_Pos (12UL)                  /*!< Position of PIN12 field.                                             */
  #define GPIO_OUT_PIN12_Msk (0x1UL << GPIO_OUT_PIN12_Pos) /*!< Bit mask of PIN12 field.                                       */
  #define GPIO_OUT_PIN12_Min (0x0UL)                 /*!< Min enumerator value of PIN12 field.                                 */
  #define GPIO_OUT_PIN12_Max (0x1UL)                 /*!< Max enumerator value of PIN12 field.                                 */
  #define GPIO_OUT_PIN12_Low (0x0UL)                 /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN12_High (0x1UL)                /*!< Pin driver is high                                                   */

/* PIN13 @Bit 13 : Pin 13 */
  #define GPIO_OUT_PIN13_Pos (13UL)                  /*!< Position of PIN13 field.                                             */
  #define GPIO_OUT_PIN13_Msk (0x1UL << GPIO_OUT_PIN13_Pos) /*!< Bit mask of PIN13 field.                                       */
  #define GPIO_OUT_PIN13_Min (0x0UL)                 /*!< Min enumerator value of PIN13 field.                                 */
  #define GPIO_OUT_PIN13_Max (0x1UL)                 /*!< Max enumerator value of PIN13 field.                                 */
  #define GPIO_OUT_PIN13_Low (0x0UL)                 /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN13_High (0x1UL)                /*!< Pin driver is high                                                   */

/* PIN14 @Bit 14 : Pin 14 */
  #define GPIO_OUT_PIN14_Pos (14UL)                  /*!< Position of PIN14 field.                                             */
  #define GPIO_OUT_PIN14_Msk (0x1UL << GPIO_OUT_PIN14_Pos) /*!< Bit mask of PIN14 field.                                       */
  #define GPIO_OUT_PIN14_Min (0x0UL)                 /*!< Min enumerator value of PIN14 field.                                 */
  #define GPIO_OUT_PIN14_Max (0x1UL)                 /*!< Max enumerator value of PIN14 field.                                 */
  #define GPIO_OUT_PIN14_Low (0x0UL)                 /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN14_High (0x1UL)                /*!< Pin driver is high                                                   */

