NordicSemiconductor/nrfx/mdk/nrf54ls05b_enga_types.h
/* PWMREADY @Bit 29 : Read pending status of interrupt for event PWMREADY */
  #define GRTC_INTPEND3_PWMREADY_Pos (29UL)          /*!< Position of PWMREADY field.                                          */
  #define GRTC_INTPEND3_PWMREADY_Msk (0x1UL << GRTC_INTPEND3_PWMREADY_Pos) /*!< Bit mask of PWMREADY field.                    */
  #define GRTC_INTPEND3_PWMREADY_Min (0x0UL)         /*!< Min enumerator value of PWMREADY field.                              */
  #define GRTC_INTPEND3_PWMREADY_Max (0x1UL)         /*!< Max enumerator value of PWMREADY field.                              */
  #define GRTC_INTPEND3_PWMREADY_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND3_PWMREADY_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* CLKOUTREADY @Bit 30 : Read pending status of interrupt for event CLKOUTREADY */
  #define GRTC_INTPEND3_CLKOUTREADY_Pos (30UL)       /*!< Position of CLKOUTREADY field.                                       */
  #define GRTC_INTPEND3_CLKOUTREADY_Msk (0x1UL << GRTC_INTPEND3_CLKOUTREADY_Pos) /*!< Bit mask of CLKOUTREADY field.           */
  #define GRTC_INTPEND3_CLKOUTREADY_Min (0x0UL)      /*!< Min enumerator value of CLKOUTREADY field.                           */
  #define GRTC_INTPEND3_CLKOUTREADY_Max (0x1UL)      /*!< Max enumerator value of CLKOUTREADY field.                           */
  #define GRTC_INTPEND3_CLKOUTREADY_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define GRTC_INTPEND3_CLKOUTREADY_Pending (0x1UL)  /*!< Read: Pending                                                        */


/* GRTC_EVTEN: Enable or disable event routing */
  #define GRTC_EVTEN_ResetValue (0x00000000UL)       /*!< Reset value of EVTEN register.                                       */

/* PWMPERIODEND @Bit 27 : Enable or disable event routing for event PWMPERIODEND */
  #define GRTC_EVTEN_PWMPERIODEND_Pos (27UL)         /*!< Position of PWMPERIODEND field.                                      */
  #define GRTC_EVTEN_PWMPERIODEND_Msk (0x1UL << GRTC_EVTEN_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.              */
  #define GRTC_EVTEN_PWMPERIODEND_Min (0x0UL)        /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define GRTC_EVTEN_PWMPERIODEND_Max (0x1UL)        /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define GRTC_EVTEN_PWMPERIODEND_Disabled (0x0UL)   /*!< Disable                                                              */
  #define GRTC_EVTEN_PWMPERIODEND_Enabled (0x1UL)    /*!< Enable                                                               */


/* GRTC_EVTENSET: Enable event routing */
  #define GRTC_EVTENSET_ResetValue (0x00000000UL)    /*!< Reset value of EVTENSET register.                                    */

/* PWMPERIODEND @Bit 27 : Write '1' to enable event routing for event PWMPERIODEND */
  #define GRTC_EVTENSET_PWMPERIODEND_Pos (27UL)      /*!< Position of PWMPERIODEND field.                                      */
  #define GRTC_EVTENSET_PWMPERIODEND_Msk (0x1UL << GRTC_EVTENSET_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.        */
  #define GRTC_EVTENSET_PWMPERIODEND_Min (0x0UL)     /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define GRTC_EVTENSET_PWMPERIODEND_Max (0x1UL)     /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define GRTC_EVTENSET_PWMPERIODEND_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define GRTC_EVTENSET_PWMPERIODEND_Enabled (0x1UL) /*!< Read: Enabled                                                        */
  #define GRTC_EVTENSET_PWMPERIODEND_Set (0x1UL)     /*!< Enable                                                               */


/* GRTC_EVTENCLR: Disable event routing */
  #define GRTC_EVTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of EVTENCLR register.                                    */

/* PWMPERIODEND @Bit 27 : Write '1' to disable event routing for event PWMPERIODEND */
  #define GRTC_EVTENCLR_PWMPERIODEND_Pos (27UL)      /*!< Position of PWMPERIODEND field.                                      */
  #define GRTC_EVTENCLR_PWMPERIODEND_Msk (0x1UL << GRTC_EVTENCLR_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.        */
  #define GRTC_EVTENCLR_PWMPERIODEND_Min (0x0UL)     /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define GRTC_EVTENCLR_PWMPERIODEND_Max (0x1UL)     /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define GRTC_EVTENCLR_PWMPERIODEND_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define GRTC_EVTENCLR_PWMPERIODEND_Enabled (0x1UL) /*!< Read: Enabled                                                        */
  #define GRTC_EVTENCLR_PWMPERIODEND_Clear (0x1UL)   /*!< Disable                                                              */


/* GRTC_MODE: Counter mode selection */
  #define GRTC_MODE_ResetValue (0x00000000UL)        /*!< Reset value of MODE register.                                        */

/* AUTOEN @Bit 0 : Automatic enable to keep the SYSCOUNTER active. */
  #define GRTC_MODE_AUTOEN_Pos (0UL)                 /*!< Position of AUTOEN field.                                            */
  #define GRTC_MODE_AUTOEN_Msk (0x1UL << GRTC_MODE_AUTOEN_Pos) /*!< Bit mask of AUTOEN field.                                  */
  #define GRTC_MODE_AUTOEN_Min (0x0UL)               /*!< Min enumerator value of AUTOEN field.                                */
  #define GRTC_MODE_AUTOEN_Max (0x1UL)               /*!< Max enumerator value of AUTOEN field.                                */
  #define GRTC_MODE_AUTOEN_Default (0x0UL)           /*!< Default configuration to keep the SYSCOUNTER active.                 */
  #define GRTC_MODE_AUTOEN_CpuActive (0x1UL)         /*!< In addition to the above mode, any local CPU that is not sleeping keep
                                                          the SYSCOUNTER active.*/

