NordicSemiconductor/nrfx/mdk/nrf54ls05b_enga_types.h
/* EDSTOPPED @Bit 16 : Write '1' to enable interrupt for event EDSTOPPED */
  #define RADIO_INTENSET10_EDSTOPPED_Pos (16UL)      /*!< Position of EDSTOPPED field.                                         */
  #define RADIO_INTENSET10_EDSTOPPED_Msk (0x1UL << RADIO_INTENSET10_EDSTOPPED_Pos) /*!< Bit mask of EDSTOPPED field.           */
  #define RADIO_INTENSET10_EDSTOPPED_Min (0x0UL)     /*!< Min enumerator value of EDSTOPPED field.                             */
  #define RADIO_INTENSET10_EDSTOPPED_Max (0x1UL)     /*!< Max enumerator value of EDSTOPPED field.                             */
  #define RADIO_INTENSET10_EDSTOPPED_Set (0x1UL)     /*!< Enable                                                               */
  #define RADIO_INTENSET10_EDSTOPPED_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENSET10_EDSTOPPED_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* CCAIDLE @Bit 17 : Write '1' to enable interrupt for event CCAIDLE */
  #define RADIO_INTENSET10_CCAIDLE_Pos (17UL)        /*!< Position of CCAIDLE field.                                           */
  #define RADIO_INTENSET10_CCAIDLE_Msk (0x1UL << RADIO_INTENSET10_CCAIDLE_Pos) /*!< Bit mask of CCAIDLE field.                 */
  #define RADIO_INTENSET10_CCAIDLE_Min (0x0UL)       /*!< Min enumerator value of CCAIDLE field.                               */
  #define RADIO_INTENSET10_CCAIDLE_Max (0x1UL)       /*!< Max enumerator value of CCAIDLE field.                               */
  #define RADIO_INTENSET10_CCAIDLE_Set (0x1UL)       /*!< Enable                                                               */
  #define RADIO_INTENSET10_CCAIDLE_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_CCAIDLE_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CCABUSY @Bit 18 : Write '1' to enable interrupt for event CCABUSY */
  #define RADIO_INTENSET10_CCABUSY_Pos (18UL)        /*!< Position of CCABUSY field.                                           */
  #define RADIO_INTENSET10_CCABUSY_Msk (0x1UL << RADIO_INTENSET10_CCABUSY_Pos) /*!< Bit mask of CCABUSY field.                 */
  #define RADIO_INTENSET10_CCABUSY_Min (0x0UL)       /*!< Min enumerator value of CCABUSY field.                               */
  #define RADIO_INTENSET10_CCABUSY_Max (0x1UL)       /*!< Max enumerator value of CCABUSY field.                               */
  #define RADIO_INTENSET10_CCABUSY_Set (0x1UL)       /*!< Enable                                                               */
  #define RADIO_INTENSET10_CCABUSY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_CCABUSY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CCASTOPPED @Bit 19 : Write '1' to enable interrupt for event CCASTOPPED */
  #define RADIO_INTENSET10_CCASTOPPED_Pos (19UL)     /*!< Position of CCASTOPPED field.                                        */
  #define RADIO_INTENSET10_CCASTOPPED_Msk (0x1UL << RADIO_INTENSET10_CCASTOPPED_Pos) /*!< Bit mask of CCASTOPPED field.        */
  #define RADIO_INTENSET10_CCASTOPPED_Min (0x0UL)    /*!< Min enumerator value of CCASTOPPED field.                            */
  #define RADIO_INTENSET10_CCASTOPPED_Max (0x1UL)    /*!< Max enumerator value of CCASTOPPED field.                            */
  #define RADIO_INTENSET10_CCASTOPPED_Set (0x1UL)    /*!< Enable                                                               */
  #define RADIO_INTENSET10_CCASTOPPED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIO_INTENSET10_CCASTOPPED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* RATEBOOST @Bit 20 : Write '1' to enable interrupt for event RATEBOOST */
  #define RADIO_INTENSET10_RATEBOOST_Pos (20UL)      /*!< Position of RATEBOOST field.                                         */
  #define RADIO_INTENSET10_RATEBOOST_Msk (0x1UL << RADIO_INTENSET10_RATEBOOST_Pos) /*!< Bit mask of RATEBOOST field.           */
  #define RADIO_INTENSET10_RATEBOOST_Min (0x0UL)     /*!< Min enumerator value of RATEBOOST field.                             */
  #define RADIO_INTENSET10_RATEBOOST_Max (0x1UL)     /*!< Max enumerator value of RATEBOOST field.                             */
  #define RADIO_INTENSET10_RATEBOOST_Set (0x1UL)     /*!< Enable                                                               */
  #define RADIO_INTENSET10_RATEBOOST_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENSET10_RATEBOOST_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* MHRMATCH @Bit 21 : Write '1' to enable interrupt for event MHRMATCH */
  #define RADIO_INTENSET10_MHRMATCH_Pos (21UL)       /*!< Position of MHRMATCH field.                                          */
  #define RADIO_INTENSET10_MHRMATCH_Msk (0x1UL << RADIO_INTENSET10_MHRMATCH_Pos) /*!< Bit mask of MHRMATCH field.              */
  #define RADIO_INTENSET10_MHRMATCH_Min (0x0UL)      /*!< Min enumerator value of MHRMATCH field.                              */
  #define RADIO_INTENSET10_MHRMATCH_Max (0x1UL)      /*!< Max enumerator value of MHRMATCH field.                              */
  #define RADIO_INTENSET10_MHRMATCH_Set (0x1UL)      /*!< Enable                                                               */
  #define RADIO_INTENSET10_MHRMATCH_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_MHRMATCH_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* SYNC @Bit 22 : Write '1' to enable interrupt for event SYNC */
  #define RADIO_INTENSET10_SYNC_Pos (22UL)           /*!< Position of SYNC field.                                              */
  #define RADIO_INTENSET10_SYNC_Msk (0x1UL << RADIO_INTENSET10_SYNC_Pos) /*!< Bit mask of SYNC field.                          */
  #define RADIO_INTENSET10_SYNC_Min (0x0UL)          /*!< Min enumerator value of SYNC field.                                  */
  #define RADIO_INTENSET10_SYNC_Max (0x1UL)          /*!< Max enumerator value of SYNC field.                                  */
  #define RADIO_INTENSET10_SYNC_Set (0x1UL)          /*!< Enable                                                               */
  #define RADIO_INTENSET10_SYNC_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET10_SYNC_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* CTEPRESENT @Bit 23 : Write '1' to enable interrupt for event CTEPRESENT */
  #define RADIO_INTENSET10_CTEPRESENT_Pos (23UL)     /*!< Position of CTEPRESENT field.                                        */
  #define RADIO_INTENSET10_CTEPRESENT_Msk (0x1UL << RADIO_INTENSET10_CTEPRESENT_Pos) /*!< Bit mask of CTEPRESENT field.        */
  #define RADIO_INTENSET10_CTEPRESENT_Min (0x0UL)    /*!< Min enumerator value of CTEPRESENT field.                            */
  #define RADIO_INTENSET10_CTEPRESENT_Max (0x1UL)    /*!< Max enumerator value of CTEPRESENT field.                            */
  #define RADIO_INTENSET10_CTEPRESENT_Set (0x1UL)    /*!< Enable                                                               */
  #define RADIO_INTENSET10_CTEPRESENT_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIO_INTENSET10_CTEPRESENT_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* RADIO_INTENCLR10: Disable interrupt */
  #define RADIO_INTENCLR10_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR10 register.                                  */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define RADIO_INTENCLR10_READY_Pos (0UL)           /*!< Position of READY field.                                             */
  #define RADIO_INTENCLR10_READY_Msk (0x1UL << RADIO_INTENCLR10_READY_Pos) /*!< Bit mask of READY field.                       */
  #define RADIO_INTENCLR10_READY_Min (0x0UL)         /*!< Min enumerator value of READY field.                                 */
  #define RADIO_INTENCLR10_READY_Max (0x1UL)         /*!< Max enumerator value of READY field.                                 */
  #define RADIO_INTENCLR10_READY_Clear (0x1UL)       /*!< Disable                                                              */
  #define RADIO_INTENCLR10_READY_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_READY_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* TXREADY @Bit 1 : Write '1' to disable interrupt for event TXREADY */
  #define RADIO_INTENCLR10_TXREADY_Pos (1UL)         /*!< Position of TXREADY field.                                           */
  #define RADIO_INTENCLR10_TXREADY_Msk (0x1UL << RADIO_INTENCLR10_TXREADY_Pos) /*!< Bit mask of TXREADY field.                 */
  #define RADIO_INTENCLR10_TXREADY_Min (0x0UL)       /*!< Min enumerator value of TXREADY field.                               */
  #define RADIO_INTENCLR10_TXREADY_Max (0x1UL)       /*!< Max enumerator value of TXREADY field.                               */
  #define RADIO_INTENCLR10_TXREADY_Clear (0x1UL)     /*!< Disable                                                              */
  #define RADIO_INTENCLR10_TXREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_TXREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

