NordicSemiconductor/nrfx/mdk/nrf54ls05b_enga_types.h
/* SPIS_PSEL_MOSI: Pin select for SDI signal */
  #define SPIS_PSEL_MOSI_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of MOSI register.                                        */

/* PIN @Bits 0..4 : Pin number */
  #define SPIS_PSEL_MOSI_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define SPIS_PSEL_MOSI_PIN_Msk (0x1FUL << SPIS_PSEL_MOSI_PIN_Pos) /*!< Bit mask of PIN field.                                */
  #define SPIS_PSEL_MOSI_PIN_Min (0x00UL)            /*!< Min value of PIN field.                                              */
  #define SPIS_PSEL_MOSI_PIN_Max (0x1FUL)            /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..7 : Port number */
  #define SPIS_PSEL_MOSI_PORT_Pos (5UL)              /*!< Position of PORT field.                                              */
  #define SPIS_PSEL_MOSI_PORT_Msk (0x7UL << SPIS_PSEL_MOSI_PORT_Pos) /*!< Bit mask of PORT field.                              */
  #define SPIS_PSEL_MOSI_PORT_Min (0x0UL)            /*!< Min value of PORT field.                                             */
  #define SPIS_PSEL_MOSI_PORT_Max (0x7UL)            /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define SPIS_PSEL_MOSI_CONNECT_Pos (31UL)          /*!< Position of CONNECT field.                                           */
  #define SPIS_PSEL_MOSI_CONNECT_Msk (0x1UL << SPIS_PSEL_MOSI_CONNECT_Pos) /*!< Bit mask of CONNECT field.                     */
  #define SPIS_PSEL_MOSI_CONNECT_Min (0x0UL)         /*!< Min enumerator value of CONNECT field.                               */
  #define SPIS_PSEL_MOSI_CONNECT_Max (0x1UL)         /*!< Max enumerator value of CONNECT field.                               */
  #define SPIS_PSEL_MOSI_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                          */
  #define SPIS_PSEL_MOSI_CONNECT_Connected (0x0UL)   /*!< Connect                                                              */


/* SPIS_PSEL_CSN: Pin select for CSN signal */
  #define SPIS_PSEL_CSN_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of CSN register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define SPIS_PSEL_CSN_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define SPIS_PSEL_CSN_PIN_Msk (0x1FUL << SPIS_PSEL_CSN_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define SPIS_PSEL_CSN_PIN_Min (0x00UL)             /*!< Min value of PIN field.                                              */
  #define SPIS_PSEL_CSN_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..7 : Port number */
  #define SPIS_PSEL_CSN_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define SPIS_PSEL_CSN_PORT_Msk (0x7UL << SPIS_PSEL_CSN_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define SPIS_PSEL_CSN_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define SPIS_PSEL_CSN_PORT_Max (0x7UL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define SPIS_PSEL_CSN_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define SPIS_PSEL_CSN_CONNECT_Msk (0x1UL << SPIS_PSEL_CSN_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define SPIS_PSEL_CSN_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define SPIS_PSEL_CSN_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define SPIS_PSEL_CSN_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define SPIS_PSEL_CSN_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */



/* ================================================ Struct SPIS_DMA_RX_MATCH ================================================= */
/**
  * @brief MATCH [SPIS_DMA_RX_MATCH] Registers to control the behavior of the pattern matcher engine
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) Configure individual match events                     */
  __IOM uint32_t  CANDIDATE[4];                      /*!< (@ 0x00000004) The data to look for - any match will trigger the
                                                                         MATCH[n] event, if enabled.*/
} NRF_SPIS_DMA_RX_MATCH_Type;                        /*!< Size = 20 (0x014)                                                    */

/* SPIS_DMA_RX_MATCH_CONFIG: Configure individual match events */
  #define SPIS_DMA_RX_MATCH_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                              */

/* ENABLE0 @Bit 0 : Enable match filter 0 */
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE0_Pos (0UL) /*!< Position of ENABLE0 field.                                           */
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE0_Msk (0x1UL << SPIS_DMA_RX_MATCH_CONFIG_ENABLE0_Pos) /*!< Bit mask of ENABLE0 field. */
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE0_Min (0x0UL) /*!< Min enumerator value of ENABLE0 field.                             */
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE0_Max (0x1UL) /*!< Max enumerator value of ENABLE0 field.                             */
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE0_Disabled (0x0UL) /*!< Match filter disabled                                         */
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE0_Enabled (0x1UL) /*!< Match filter enabled                                           */

/* ENABLE1 @Bit 1 : Enable match filter 1 */
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE1_Pos (1UL) /*!< Position of ENABLE1 field.                                           */
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE1_Msk (0x1UL << SPIS_DMA_RX_MATCH_CONFIG_ENABLE1_Pos) /*!< Bit mask of ENABLE1 field. */
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE1_Min (0x0UL) /*!< Min enumerator value of ENABLE1 field.                             */
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE1_Max (0x1UL) /*!< Max enumerator value of ENABLE1 field.                             */
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE1_Disabled (0x0UL) /*!< Match filter disabled                                         */
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE1_Enabled (0x1UL) /*!< Match filter enabled                                           */

