NordicSemiconductor/nrfx/mdk/nrf54ls05b_enga_types.h
/* CPOL @Bit 2 : Serial clock (SCK) polarity */
  #define SPIS_CONFIG_CPOL_Pos (2UL)                 /*!< Position of CPOL field.                                              */
  #define SPIS_CONFIG_CPOL_Msk (0x1UL << SPIS_CONFIG_CPOL_Pos) /*!< Bit mask of CPOL field.                                    */
  #define SPIS_CONFIG_CPOL_Min (0x0UL)               /*!< Min enumerator value of CPOL field.                                  */
  #define SPIS_CONFIG_CPOL_Max (0x1UL)               /*!< Max enumerator value of CPOL field.                                  */
  #define SPIS_CONFIG_CPOL_ActiveHigh (0x0UL)        /*!< Active high                                                          */
  #define SPIS_CONFIG_CPOL_ActiveLow (0x1UL)         /*!< Active low                                                           */


/* SPIS_DEF: Default character. Character clocked out in case of an ignored transaction. */
  #define SPIS_DEF_ResetValue (0x00000000UL)         /*!< Reset value of DEF register.                                         */

/* DEF @Bits 0..7 : Default character. Character clocked out in case of an ignored transaction. */
  #define SPIS_DEF_DEF_Pos (0UL)                     /*!< Position of DEF field.                                               */
  #define SPIS_DEF_DEF_Msk (0xFFUL << SPIS_DEF_DEF_Pos) /*!< Bit mask of DEF field.                                            */


/* SPIS_ORC: Over-read character */
  #define SPIS_ORC_ResetValue (0x00000000UL)         /*!< Reset value of ORC register.                                         */

/* ORC @Bits 0..7 : Over-read character. Character clocked out after an over-read of the transmit buffer. */
  #define SPIS_ORC_ORC_Pos (0UL)                     /*!< Position of ORC field.                                               */
  #define SPIS_ORC_ORC_Msk (0xFFUL << SPIS_ORC_ORC_Pos) /*!< Bit mask of ORC field.                                            */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            SWI                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct SWI ======================================================== */
/**
  * @brief Software interrupt
  */
  typedef struct {                                   /*!< SWI Structure                                                        */
    __IM uint32_t RESERVED;
  } NRF_SWI_Type;                                    /*!< Size = 4 (0x004)                                                     */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            TAD                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct TAD ======================================================== */
/**
  * @brief Trace and debug control
  */
  typedef struct {                                   /*!< TAD Structure                                                        */
    __IM uint32_t RESERVED[320];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable debug domain and aquire selected GPIOs         */
    __IM uint32_t RESERVED1[5];
    __IOM uint32_t TRACEPORTSPEED;                   /*!< (@ 0x00000518) Trace port speed                                      */
  } NRF_TAD_Type;                                    /*!< Size = 1308 (0x51C)                                                  */

/* TAD_ENABLE: Enable debug domain and aquire selected GPIOs */
  #define TAD_ENABLE_ResetValue (0x00000000UL)       /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : (unspecified) */
  #define TAD_ENABLE_ENABLE_Pos (0UL)                /*!< Position of ENABLE field.                                            */
  #define TAD_ENABLE_ENABLE_Msk (0x1UL << TAD_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                                */
  #define TAD_ENABLE_ENABLE_Min (0x0UL)              /*!< Min enumerator value of ENABLE field.                                */
  #define TAD_ENABLE_ENABLE_Max (0x1UL)              /*!< Max enumerator value of ENABLE field.                                */
  #define TAD_ENABLE_ENABLE_DISABLED (0x0UL)         /*!< Disable debug domain and release selected GPIOs                      */
  #define TAD_ENABLE_ENABLE_ENABLED (0x1UL)          /*!< Enable debug domain and aquire selected GPIOs                        */


/* TAD_TRACEPORTSPEED: Trace port speed */
  #define TAD_TRACEPORTSPEED_ResetValue (0x00000000UL) /*!< Reset value of TRACEPORTSPEED register.                            */

/* TRACEPORTSPEED @Bits 0..1 : Trace port speed is divided from CPU clock. The TRACECLK pin output will be divided again by two
                               from the trace port clock. */

  #define TAD_TRACEPORTSPEED_TRACEPORTSPEED_Pos (0UL) /*!< Position of TRACEPORTSPEED field.                                   */
  #define TAD_TRACEPORTSPEED_TRACEPORTSPEED_Msk (0x3UL << TAD_TRACEPORTSPEED_TRACEPORTSPEED_Pos) /*!< Bit mask of TRACEPORTSPEED
                                                                            field.*/
  #define TAD_TRACEPORTSPEED_TRACEPORTSPEED_Min (0x0UL) /*!< Min enumerator value of TRACEPORTSPEED field.                     */
  #define TAD_TRACEPORTSPEED_TRACEPORTSPEED_Max (0x3UL) /*!< Max enumerator value of TRACEPORTSPEED field.                     */
  #define TAD_TRACEPORTSPEED_TRACEPORTSPEED_DIV1 (0x0UL) /*!< Trace port speed equals CPU clock                                */
  #define TAD_TRACEPORTSPEED_TRACEPORTSPEED_DIV2 (0x1UL) /*!< Trace port speed equals CPU clock divided by 2                   */
  #define TAD_TRACEPORTSPEED_TRACEPORTSPEED_DIV4 (0x2UL) /*!< Trace port speed equals CPU clock divided by 4                   */
  #define TAD_TRACEPORTSPEED_TRACEPORTSPEED_DIV32 (0x3UL) /*!< Trace port speed equals CPU clock divided by 32                 */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TAMPC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct TAMPC_ACTIVESHIELD ================================================ */
/**
  * @brief ACTIVESHIELD [TAMPC_ACTIVESHIELD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CHEN;                              /*!< (@ 0x00000000) Active shield detector channel enable register.       */
} NRF_TAMPC_ACTIVESHIELD_Type;                       /*!< Size = 4 (0x004)                                                     */

/* TAMPC_ACTIVESHIELD_CHEN: Active shield detector channel enable register. */
  #define TAMPC_ACTIVESHIELD_CHEN_ResetValue (0x00000000UL) /*!< Reset value of CHEN register.                                 */

/* CH0 @Bit 0 : Enable or disable active shield channel 0. */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Pos (0UL)      /*!< Position of CH0 field.                                               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Msk (0x1UL << TAMPC_ACTIVESHIELD_CHEN_CH0_Pos) /*!< Bit mask of CH0 field.               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Min (0x0UL)    /*!< Min enumerator value of CH0 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Max (0x1UL)    /*!< Max enumerator value of CH0 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Disabled (0x0UL) /*!< Disable channel.                                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Enabled (0x1UL) /*!< Enable channel.                                                     */

/* CH1 @Bit 1 : Enable or disable active shield channel 1. */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Pos (1UL)      /*!< Position of CH1 field.                                               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Msk (0x1UL << TAMPC_ACTIVESHIELD_CHEN_CH1_Pos) /*!< Bit mask of CH1 field.               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Min (0x0UL)    /*!< Min enumerator value of CH1 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Max (0x1UL)    /*!< Max enumerator value of CH1 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Disabled (0x0UL) /*!< Disable channel.                                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Enabled (0x1UL) /*!< Enable channel.                                                     */

