NordicSemiconductor/nrfx/mdk/nrf54ls05b_enga_types.h
  #define TRNG_RNGCONTROL_CONTROL_LFSREN_Pos (1UL)   /*!< Position of LFSREN field.                                            */
  #define TRNG_RNGCONTROL_CONTROL_LFSREN_Msk (0x1UL << TRNG_RNGCONTROL_CONTROL_LFSREN_Pos) /*!< Bit mask of LFSREN field.      */

/* TESTEN @Bit 2 : Select input for conditioning function and continuous tests: */
  #define TRNG_RNGCONTROL_CONTROL_TESTEN_Pos (2UL)   /*!< Position of TESTEN field.                                            */
  #define TRNG_RNGCONTROL_CONTROL_TESTEN_Msk (0x1UL << TRNG_RNGCONTROL_CONTROL_TESTEN_Pos) /*!< Bit mask of TESTEN field.      */
  #define TRNG_RNGCONTROL_CONTROL_TESTEN_Min (0x0UL) /*!< Min enumerator value of TESTEN field.                                */
  #define TRNG_RNGCONTROL_CONTROL_TESTEN_Max (0x1UL) /*!< Max enumerator value of TESTEN field.                                */
  #define TRNG_RNGCONTROL_CONTROL_TESTEN_NORMAL (0x0UL) /*!< Noise source (normal mode).                                       */
  #define TRNG_RNGCONTROL_CONTROL_TESTEN_TEST (0x1UL) /*!< Test data register (test mode).                                     */

/* CONDBYPASS @Bit 3 : Conditioning function bypass. */
  #define TRNG_RNGCONTROL_CONTROL_CONDBYPASS_Pos (3UL) /*!< Position of CONDBYPASS field.                                      */
  #define TRNG_RNGCONTROL_CONTROL_CONDBYPASS_Msk (0x1UL << TRNG_RNGCONTROL_CONTROL_CONDBYPASS_Pos) /*!< Bit mask of CONDBYPASS
                                                                            field.*/
  #define TRNG_RNGCONTROL_CONTROL_CONDBYPASS_Min (0x0UL) /*!< Min enumerator value of CONDBYPASS field.                        */
  #define TRNG_RNGCONTROL_CONTROL_CONDBYPASS_Max (0x1UL) /*!< Max enumerator value of CONDBYPASS field.                        */
  #define TRNG_RNGCONTROL_CONTROL_CONDBYPASS_NORMAL (0x0UL) /*!< the conditioning function is used (normal mode).              */
  #define TRNG_RNGCONTROL_CONTROL_CONDBYPASS_BYPASS (0x1UL) /*!< the conditioning function is bypassed (to observe entropy
                                                                 source directly).*/

/* INTENREP @Bit 4 : Enable interrupt if any of the health test fails. */
  #define TRNG_RNGCONTROL_CONTROL_INTENREP_Pos (4UL) /*!< Position of INTENREP field.                                          */
  #define TRNG_RNGCONTROL_CONTROL_INTENREP_Msk (0x1UL << TRNG_RNGCONTROL_CONTROL_INTENREP_Pos) /*!< Bit mask of INTENREP field.*/

/* INTENFULL @Bit 7 : Enable interrupt if FIFO is full. */
  #define TRNG_RNGCONTROL_CONTROL_INTENFULL_Pos (7UL) /*!< Position of INTENFULL field.                                        */
  #define TRNG_RNGCONTROL_CONTROL_INTENFULL_Msk (0x1UL << TRNG_RNGCONTROL_CONTROL_INTENFULL_Pos) /*!< Bit mask of INTENFULL
                                                                            field.*/

/* SOFTRST @Bit 8 : Datapath content flush and control FSM */
  #define TRNG_RNGCONTROL_CONTROL_SOFTRST_Pos (8UL)  /*!< Position of SOFTRST field.                                           */
  #define TRNG_RNGCONTROL_CONTROL_SOFTRST_Msk (0x1UL << TRNG_RNGCONTROL_CONTROL_SOFTRST_Pos) /*!< Bit mask of SOFTRST field.   */

/* FORCEACTIVEROS @Bit 11 : Force oscillators to run when FIFO is full. */
  #define TRNG_RNGCONTROL_CONTROL_FORCEACTIVEROS_Pos (11UL) /*!< Position of FORCEACTIVEROS field.                             */
  #define TRNG_RNGCONTROL_CONTROL_FORCEACTIVEROS_Msk (0x1UL << TRNG_RNGCONTROL_CONTROL_FORCEACTIVEROS_Pos) /*!< Bit mask of
                                                                            FORCEACTIVEROS field.*/

/* IGNOREHEALTHTESTSFAILFORFSM @Bit 12 : Results of the health tests during start-up and online test do not affect the control
                                         FSM state. */

  #define TRNG_RNGCONTROL_CONTROL_IGNOREHEALTHTESTSFAILFORFSM_Pos (12UL) /*!< Position of IGNOREHEALTHTESTSFAILFORFSM field.   */
  #define TRNG_RNGCONTROL_CONTROL_IGNOREHEALTHTESTSFAILFORFSM_Msk (0x1UL << TRNG_RNGCONTROL_CONTROL_IGNOREHEALTHTESTSFAILFORFSM_Pos)
                                                                            /*!< Bit mask of IGNOREHEALTHTESTSFAILFORFSM field.*/

/* NB128BITBLOCKS @Bits 16..19 : Number of 128 bit blocks used in conditioning (AES-CBC-MAC) post-processing. */
  #define TRNG_RNGCONTROL_CONTROL_NB128BITBLOCKS_Pos (16UL) /*!< Position of NB128BITBLOCKS field.                             */
  #define TRNG_RNGCONTROL_CONTROL_NB128BITBLOCKS_Msk (0xFUL << TRNG_RNGCONTROL_CONTROL_NB128BITBLOCKS_Pos) /*!< Bit mask of
                                                                            NB128BITBLOCKS field.*/

/* FIFOWRITESTARTUP @Bit 20 : Enable write of the samples in the FIFO during start-up. */
  #define TRNG_RNGCONTROL_CONTROL_FIFOWRITESTARTUP_Pos (20UL) /*!< Position of FIFOWRITESTARTUP field.                         */
  #define TRNG_RNGCONTROL_CONTROL_FIFOWRITESTARTUP_Msk (0x1UL << TRNG_RNGCONTROL_CONTROL_FIFOWRITESTARTUP_Pos) /*!< Bit mask of
                                                                            FIFOWRITESTARTUP field.*/

/* DISREPETTESTS @Bit 21 : All repetition tests (each share) are disabled via this single bit. */
  #define TRNG_RNGCONTROL_CONTROL_DISREPETTESTS_Pos (21UL) /*!< Position of DISREPETTESTS field.                               */
  #define TRNG_RNGCONTROL_CONTROL_DISREPETTESTS_Msk (0x1UL << TRNG_RNGCONTROL_CONTROL_DISREPETTESTS_Pos) /*!< Bit mask of
                                                                            DISREPETTESTS field.*/

/* DISPROPTESTS @Bit 22 : All proportion tests (each share) are disabled via this single bit. */
  #define TRNG_RNGCONTROL_CONTROL_DISPROPTESTS_Pos (22UL) /*!< Position of DISPROPTESTS field.                                 */
  #define TRNG_RNGCONTROL_CONTROL_DISPROPTESTS_Msk (0x1UL << TRNG_RNGCONTROL_CONTROL_DISPROPTESTS_Pos) /*!< Bit mask of
                                                                            DISPROPTESTS field.*/

/* DISAUTOCORRTESTS @Bits 23..24 : Disable specific delay(s) check in auto-correlation test - same RO: */
  #define TRNG_RNGCONTROL_CONTROL_DISAUTOCORRTESTS_Pos (23UL) /*!< Position of DISAUTOCORRTESTS field.                         */
  #define TRNG_RNGCONTROL_CONTROL_DISAUTOCORRTESTS_Msk (0x3UL << TRNG_RNGCONTROL_CONTROL_DISAUTOCORRTESTS_Pos) /*!< Bit mask of
                                                                            DISAUTOCORRTESTS field.*/

