NordicSemiconductor/nrfx/mdk/nrf54ls05b_enga_types.h
/* DISCORRTESTS @Bits 27..29 : Disable specific delay(s) check in correlation test - different ROs: */
  #define TRNG_RNGCONTROL_CONTROL_DISCORRTESTS_Pos (27UL) /*!< Position of DISCORRTESTS field.                                 */
  #define TRNG_RNGCONTROL_CONTROL_DISCORRTESTS_Msk (0x7UL << TRNG_RNGCONTROL_CONTROL_DISCORRTESTS_Pos) /*!< Bit mask of
                                                                            DISCORRTESTS field.*/

/* BLENDINGMETHOD @Bits 30..31 : Select blending method */
  #define TRNG_RNGCONTROL_CONTROL_BLENDINGMETHOD_Pos (30UL) /*!< Position of BLENDINGMETHOD field.                             */
  #define TRNG_RNGCONTROL_CONTROL_BLENDINGMETHOD_Msk (0x3UL << TRNG_RNGCONTROL_CONTROL_BLENDINGMETHOD_Pos) /*!< Bit mask of
                                                                            BLENDINGMETHOD field.*/
  #define TRNG_RNGCONTROL_CONTROL_BLENDINGMETHOD_Min (0x0UL) /*!< Min enumerator value of BLENDINGMETHOD field.                */
  #define TRNG_RNGCONTROL_CONTROL_BLENDINGMETHOD_Max (0x3UL) /*!< Max enumerator value of BLENDINGMETHOD field.                */
  #define TRNG_RNGCONTROL_CONTROL_BLENDINGMETHOD_CONCATENATION (0x0UL) /*!< Concatenation                                      */
  #define TRNG_RNGCONTROL_CONTROL_BLENDINGMETHOD_XORLEVEL1 (0x1UL) /*!< XOR level 1                                            */
  #define TRNG_RNGCONTROL_CONTROL_BLENDINGMETHOD_XORLEVEL2 (0x2UL) /*!< XOR level 2                                            */
  #define TRNG_RNGCONTROL_CONTROL_BLENDINGMETHOD_VONNEUMANN (0x3UL) /*!< VON-NEUMANN debiasing                                 */


/* TRNG_RNGCONTROL_FIFOLEVEL: FIFO level register. */
  #define TRNG_RNGCONTROL_FIFOLEVEL_ResetValue (0x00000000UL) /*!< Reset value of FIFOLEVEL register.                          */

/* FIFOLEVEL @Bits 0..31 : Number of 32 bits words of random values available in the FIFO. */
  #define TRNG_RNGCONTROL_FIFOLEVEL_FIFOLEVEL_Pos (0UL) /*!< Position of FIFOLEVEL field.                                      */
  #define TRNG_RNGCONTROL_FIFOLEVEL_FIFOLEVEL_Msk (0xFFFFFFFFUL << TRNG_RNGCONTROL_FIFOLEVEL_FIFOLEVEL_Pos) /*!< Bit mask of
                                                                            FIFOLEVEL field.*/


/* TRNG_RNGCONTROL_FIFOTHRESHOLD: FIFO threshold register. */
  #define TRNG_RNGCONTROL_FIFOTHRESHOLD_ResetValue (0x00000003UL) /*!< Reset value of FIFOTHRESHOLD register.                  */

/* FIFOTHRESHOLD @Bits 0..31 : FIFO level below which the module leaves the idle state to refill the FIFO, expressed in number
                               of 128bit blocks. */

  #define TRNG_RNGCONTROL_FIFOTHRESHOLD_FIFOTHRESHOLD_Pos (0UL) /*!< Position of FIFOTHRESHOLD field.                          */
  #define TRNG_RNGCONTROL_FIFOTHRESHOLD_FIFOTHRESHOLD_Msk (0xFFFFFFFFUL << TRNG_RNGCONTROL_FIFOTHRESHOLD_FIFOTHRESHOLD_Pos) /*!<
                                                                            Bit mask of FIFOTHRESHOLD field.*/


/* TRNG_RNGCONTROL_FIFODEPTH: FIFO depth register. */
  #define TRNG_RNGCONTROL_FIFODEPTH_ResetValue (0x00000010UL) /*!< Reset value of FIFODEPTH register.                          */

/* FIFODEPTH @Bits 0..31 : Maximum number of 32 bits words that can be stored in the FIFO. */
  #define TRNG_RNGCONTROL_FIFODEPTH_FIFODEPTH_Pos (0UL) /*!< Position of FIFODEPTH field.                                      */
  #define TRNG_RNGCONTROL_FIFODEPTH_FIFODEPTH_Msk (0xFFFFFFFFUL << TRNG_RNGCONTROL_FIFODEPTH_FIFODEPTH_Pos) /*!< Bit mask of
                                                                            FIFODEPTH field.*/


/* TRNG_RNGCONTROL_KEY: Key register. */
  #define TRNG_RNGCONTROL_KEY_MaxCount (4UL)         /*!< Max size of KEY[4] array.                                            */
  #define TRNG_RNGCONTROL_KEY_MaxIndex (3UL)         /*!< Max index of KEY[4] array.                                           */
  #define TRNG_RNGCONTROL_KEY_MinIndex (0UL)         /*!< Min index of KEY[4] array.                                           */
  #define TRNG_RNGCONTROL_KEY_ResetValue (0x00000000UL) /*!< Reset value of KEY[4] register.                                   */

/* KEY @Bits 0..31 : Key register. */
  #define TRNG_RNGCONTROL_KEY_KEY_Pos (0UL)          /*!< Position of KEY field.                                               */
  #define TRNG_RNGCONTROL_KEY_KEY_Msk (0xFFFFFFFFUL << TRNG_RNGCONTROL_KEY_KEY_Pos) /*!< Bit mask of KEY field.                */


/* TRNG_RNGCONTROL_TESTDATA: Test data register. */
  #define TRNG_RNGCONTROL_TESTDATA_ResetValue (0x00000000UL) /*!< Reset value of TESTDATA register.                            */

/* TESTDATA @Bits 0..31 : Test data register. */
  #define TRNG_RNGCONTROL_TESTDATA_TESTDATA_Pos (0UL) /*!< Position of TESTDATA field.                                         */
  #define TRNG_RNGCONTROL_TESTDATA_TESTDATA_Msk (0xFFFFFFFFUL << TRNG_RNGCONTROL_TESTDATA_TESTDATA_Pos) /*!< Bit mask of
                                                                            TESTDATA field.*/


/* TRNG_RNGCONTROL_REPEATTHRESHOLD: Repetition test cut-off register. */
  #define TRNG_RNGCONTROL_REPEATTHRESHOLD_ResetValue (0x00000004UL) /*!< Reset value of REPEATTHRESHOLD register.              */

/* REPEATTHRESHOLD @Bits 0..5 : Repetition Test cut-off value. */
  #define TRNG_RNGCONTROL_REPEATTHRESHOLD_REPEATTHRESHOLD_Pos (0UL) /*!< Position of REPEATTHRESHOLD field.                    */
  #define TRNG_RNGCONTROL_REPEATTHRESHOLD_REPEATTHRESHOLD_Msk (0x3FUL << TRNG_RNGCONTROL_REPEATTHRESHOLD_REPEATTHRESHOLD_Pos)
                                                                            /*!< Bit mask of REPEATTHRESHOLD field.*/


/* TRNG_RNGCONTROL_PROPTESTCUTOFF: Proportion test cut-off register. */
  #define TRNG_RNGCONTROL_PROPTESTCUTOFF_ResetValue (0x0000000DUL) /*!< Reset value of PROPTESTCUTOFF register.                */

/* PROPTESTCUTOFF @Bits 0..8 : Proportion test cut-off value. */
  #define TRNG_RNGCONTROL_PROPTESTCUTOFF_PROPTESTCUTOFF_Pos (0UL) /*!< Position of PROPTESTCUTOFF field.                       */
  #define TRNG_RNGCONTROL_PROPTESTCUTOFF_PROPTESTCUTOFF_Msk (0x1FFUL << TRNG_RNGCONTROL_PROPTESTCUTOFF_PROPTESTCUTOFF_Pos) /*!<
                                                                            Bit mask of PROPTESTCUTOFF field.*/


