NordicSemiconductor/nrfx/mdk/nrf54ls05b_enga_types.h
/* TRNG_RNGCONTROL_LFSRSEED: LFSR seed register. */
  #define TRNG_RNGCONTROL_LFSRSEED_ResetValue (0x00FFFFFFUL) /*!< Reset value of LFSRSEED register.                            */

/* LFSRSEED @Bits 0..23 : LFSR initialization value. */
  #define TRNG_RNGCONTROL_LFSRSEED_LFSRSEED_Pos (0UL) /*!< Position of LFSRSEED field.                                         */
  #define TRNG_RNGCONTROL_LFSRSEED_LFSRSEED_Msk (0xFFFFFFUL << TRNG_RNGCONTROL_LFSRSEED_LFSRSEED_Pos) /*!< Bit mask of LFSRSEED
                                                                            field.*/

/* LFSRSSELECTION @Bits 24..25 : Share index for which initialization value should be used. */
  #define TRNG_RNGCONTROL_LFSRSEED_LFSRSSELECTION_Pos (24UL) /*!< Position of LFSRSSELECTION field.                            */
  #define TRNG_RNGCONTROL_LFSRSEED_LFSRSSELECTION_Msk (0x3UL << TRNG_RNGCONTROL_LFSRSEED_LFSRSSELECTION_Pos) /*!< Bit mask of
                                                                            LFSRSSELECTION field.*/


/* TRNG_RNGCONTROL_STATUS: Status register. */
  #define TRNG_RNGCONTROL_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                                */

/* TESTDATABUSY @Bit 0 : High when data written to TestData register is being processed. */
  #define TRNG_RNGCONTROL_STATUS_TESTDATABUSY_Pos (0UL) /*!< Position of TESTDATABUSY field.                                   */
  #define TRNG_RNGCONTROL_STATUS_TESTDATABUSY_Msk (0x1UL << TRNG_RNGCONTROL_STATUS_TESTDATABUSY_Pos) /*!< Bit mask of
                                                                            TESTDATABUSY field.*/

/* STATE @Bits 1..3 : State of the control FSM: */
  #define TRNG_RNGCONTROL_STATUS_STATE_Pos (1UL)     /*!< Position of STATE field.                                             */
  #define TRNG_RNGCONTROL_STATUS_STATE_Msk (0x7UL << TRNG_RNGCONTROL_STATUS_STATE_Pos) /*!< Bit mask of STATE field.           */
  #define TRNG_RNGCONTROL_STATUS_STATE_Min (0x0UL)   /*!< Min enumerator value of STATE field.                                 */
  #define TRNG_RNGCONTROL_STATUS_STATE_Max (0x5UL)   /*!< Max enumerator value of STATE field.                                 */
  #define TRNG_RNGCONTROL_STATUS_STATE_RESET (0x0UL) /*!< Reset                                                                */
  #define TRNG_RNGCONTROL_STATUS_STATE_STARTUP (0x1UL) /*!< Startup                                                            */
  #define TRNG_RNGCONTROL_STATUS_STATE_IDLERON (0x2UL) /*!< Idle / FIFO full                                                   */
  #define TRNG_RNGCONTROL_STATUS_STATE_FILLFIFO (0x4UL) /*!< Fill FIFO                                                         */
  #define TRNG_RNGCONTROL_STATUS_STATE_ERROR (0x5UL) /*!< Error                                                                */

/* REPFAIL @Bit 4 : NIST repetition test(s) failure. */
  #define TRNG_RNGCONTROL_STATUS_REPFAIL_Pos (4UL)   /*!< Position of REPFAIL field.                                           */
  #define TRNG_RNGCONTROL_STATUS_REPFAIL_Msk (0x1UL << TRNG_RNGCONTROL_STATUS_REPFAIL_Pos) /*!< Bit mask of REPFAIL field.     */

/* PROPFAIL @Bit 5 : NIST proportion test(s) failure. */
  #define TRNG_RNGCONTROL_STATUS_PROPFAIL_Pos (5UL)  /*!< Position of PROPFAIL field.                                          */
  #define TRNG_RNGCONTROL_STATUS_PROPFAIL_Msk (0x1UL << TRNG_RNGCONTROL_STATUS_PROPFAIL_Pos) /*!< Bit mask of PROPFAIL field.  */

/* ANYHEALTHTESTFAIL @Bit 6 : Any of the enabled health tests is failing. */
  #define TRNG_RNGCONTROL_STATUS_ANYHEALTHTESTFAIL_Pos (6UL) /*!< Position of ANYHEALTHTESTFAIL field.                         */
  #define TRNG_RNGCONTROL_STATUS_ANYHEALTHTESTFAIL_Msk (0x1UL << TRNG_RNGCONTROL_STATUS_ANYHEALTHTESTFAIL_Pos) /*!< Bit mask of
                                                                            ANYHEALTHTESTFAIL field.*/

/* FULLINT @Bit 7 : FIFO full status. */
  #define TRNG_RNGCONTROL_STATUS_FULLINT_Pos (7UL)   /*!< Position of FULLINT field.                                           */
  #define TRNG_RNGCONTROL_STATUS_FULLINT_Msk (0x1UL << TRNG_RNGCONTROL_STATUS_FULLINT_Pos) /*!< Bit mask of FULLINT field.     */

/* STARTUPFAIL @Bit 10 : Start-up test(s) failure. */
  #define TRNG_RNGCONTROL_STATUS_STARTUPFAIL_Pos (10UL) /*!< Position of STARTUPFAIL field.                                    */
  #define TRNG_RNGCONTROL_STATUS_STARTUPFAIL_Msk (0x1UL << TRNG_RNGCONTROL_STATUS_STARTUPFAIL_Pos) /*!< Bit mask of STARTUPFAIL
                                                                            field.*/

/* REPTESTFAILPERSHARE @Bits 12..15 : NIST Repetition test failure per share. */
  #define TRNG_RNGCONTROL_STATUS_REPTESTFAILPERSHARE_Pos (12UL) /*!< Position of REPTESTFAILPERSHARE field.                    */
  #define TRNG_RNGCONTROL_STATUS_REPTESTFAILPERSHARE_Msk (0xFUL << TRNG_RNGCONTROL_STATUS_REPTESTFAILPERSHARE_Pos) /*!< Bit mask
                                                                            of REPTESTFAILPERSHARE field.*/

/* PROPTESTFAILPERSHARE @Bits 16..19 : NIST Proportion test failure per share. */
  #define TRNG_RNGCONTROL_STATUS_PROPTESTFAILPERSHARE_Pos (16UL) /*!< Position of PROPTESTFAILPERSHARE field.                  */
  #define TRNG_RNGCONTROL_STATUS_PROPTESTFAILPERSHARE_Msk (0xFUL << TRNG_RNGCONTROL_STATUS_PROPTESTFAILPERSHARE_Pos) /*!< Bit
                                                                            mask of PROPTESTFAILPERSHARE field.*/

/* CONDITIONINGISTOOSLOW @Bit 20 : Conditioning consumes data slower than they are provided to it. */
  #define TRNG_RNGCONTROL_STATUS_CONDITIONINGISTOOSLOW_Pos (20UL) /*!< Position of CONDITIONINGISTOOSLOW field.                */
  #define TRNG_RNGCONTROL_STATUS_CONDITIONINGISTOOSLOW_Msk (0x1UL << TRNG_RNGCONTROL_STATUS_CONDITIONINGISTOOSLOW_Pos) /*!< Bit
                                                                            mask of CONDITIONINGISTOOSLOW field.*/


/* TRNG_RNGCONTROL_WARMUPPERIOD: Number of clock cycles in warm-up sequence. */
  #define TRNG_RNGCONTROL_WARMUPPERIOD_ResetValue (0x00000200UL) /*!< Reset value of WARMUPPERIOD register.                    */

