NordicSemiconductor/nrfx/mdk/nrf54ls05b_enga_types.h
/* WARMUPPERIOD @Bits 0..11 : Number of clock cycles in warm-up sequence. */
  #define TRNG_RNGCONTROL_WARMUPPERIOD_WARMUPPERIOD_Pos (0UL) /*!< Position of WARMUPPERIOD field.                             */
  #define TRNG_RNGCONTROL_WARMUPPERIOD_WARMUPPERIOD_Msk (0xFFFUL << TRNG_RNGCONTROL_WARMUPPERIOD_WARMUPPERIOD_Pos) /*!< Bit mask
                                                                            of WARMUPPERIOD field.*/


/* TRNG_RNGCONTROL_DISABLEOSC: DisableOsc register. */
  #define TRNG_RNGCONTROL_DISABLEOSC_ResetValue (0x00000000UL) /*!< Reset value of DISABLEOSC register.                        */

/* DISABLEOSC @Bits 0..7 : Disable oscillator rings 0 to 7. */
  #define TRNG_RNGCONTROL_DISABLEOSC_DISABLEOSC_Pos (0UL) /*!< Position of DISABLEOSC field.                                   */
  #define TRNG_RNGCONTROL_DISABLEOSC_DISABLEOSC_Msk (0xFFUL << TRNG_RNGCONTROL_DISABLEOSC_DISABLEOSC_Pos) /*!< Bit mask of
                                                                            DISABLEOSC field.*/


/* TRNG_RNGCONTROL_SAMPLINGPERIOD: Number of clock cycles between sampling moments. */
  #define TRNG_RNGCONTROL_SAMPLINGPERIOD_ResetValue (0x00000FFFUL) /*!< Reset value of SAMPLINGPERIOD register.                */

/* SAMPLINGPERIOD @Bits 0..11 : Number of clock cycles between sampling moments. */
  #define TRNG_RNGCONTROL_SAMPLINGPERIOD_SAMPLINGPERIOD_Pos (0UL) /*!< Position of SAMPLINGPERIOD field.                       */
  #define TRNG_RNGCONTROL_SAMPLINGPERIOD_SAMPLINGPERIOD_Msk (0xFFFUL << TRNG_RNGCONTROL_SAMPLINGPERIOD_SAMPLINGPERIOD_Pos) /*!<
                                                                            Bit mask of SAMPLINGPERIOD field.*/


/* TRNG_RNGCONTROL_HWCONFIG: Hardware configuration register. */
  #define TRNG_RNGCONTROL_HWCONFIG_ResetValue (0x0002410FUL) /*!< Reset value of HWCONFIG register.                            */

/* NBOFINV @Bits 0..7 : Generic g_NbOfInverters value. */
  #define TRNG_RNGCONTROL_HWCONFIG_NBOFINV_Pos (0UL) /*!< Position of NBOFINV field.                                           */
  #define TRNG_RNGCONTROL_HWCONFIG_NBOFINV_Msk (0xFFUL << TRNG_RNGCONTROL_HWCONFIG_NBOFINV_Pos) /*!< Bit mask of NBOFINV field.*/

/* LOG2NBOFAUTOCORRTESTSPERSHARE @Bits 8..11 : Generic g_Log2NbOfAutoCorrTestsPerShare value. */
  #define TRNG_RNGCONTROL_HWCONFIG_LOG2NBOFAUTOCORRTESTSPERSHARE_Pos (8UL) /*!< Position of LOG2NBOFAUTOCORRTESTSPERSHARE
                                                                            field.*/
  #define TRNG_RNGCONTROL_HWCONFIG_LOG2NBOFAUTOCORRTESTSPERSHARE_Msk (0xFUL << TRNG_RNGCONTROL_HWCONFIG_LOG2NBOFAUTOCORRTESTSPERSHARE_Pos)
                                                                            /*!< Bit mask of LOG2NBOFAUTOCORRTESTSPERSHARE
                                                                            field.*/

/* LOG2FIFODEPTH @Bits 12..15 : Generic g_Log2FifoDepth value. */
  #define TRNG_RNGCONTROL_HWCONFIG_LOG2FIFODEPTH_Pos (12UL) /*!< Position of LOG2FIFODEPTH field.                              */
  #define TRNG_RNGCONTROL_HWCONFIG_LOG2FIFODEPTH_Msk (0xFUL << TRNG_RNGCONTROL_HWCONFIG_LOG2FIFODEPTH_Pos) /*!< Bit mask of
                                                                            LOG2FIFODEPTH field.*/

/* LOG2NBOFSHARES @Bits 16..17 : Generic g_Log2NbOfShares value. */
  #define TRNG_RNGCONTROL_HWCONFIG_LOG2NBOFSHARES_Pos (16UL) /*!< Position of LOG2NBOFSHARES field.                            */
  #define TRNG_RNGCONTROL_HWCONFIG_LOG2NBOFSHARES_Msk (0x3UL << TRNG_RNGCONTROL_HWCONFIG_LOG2NBOFSHARES_Pos) /*!< Bit mask of
                                                                            LOG2NBOFSHARES field.*/


/* TRNG_RNGCONTROL_COOLDOWNPERIOD: Number of clock cycles in cool-down sequence. */
  #define TRNG_RNGCONTROL_COOLDOWNPERIOD_ResetValue (0x00000000UL) /*!< Reset value of COOLDOWNPERIOD register.                */

/* COOLDOWNPERIOD @Bits 0..11 : Number of clock cycles in cool-down sequence. */
  #define TRNG_RNGCONTROL_COOLDOWNPERIOD_COOLDOWNPERIOD_Pos (0UL) /*!< Position of COOLDOWNPERIOD field.                       */
  #define TRNG_RNGCONTROL_COOLDOWNPERIOD_COOLDOWNPERIOD_Msk (0xFFFUL << TRNG_RNGCONTROL_COOLDOWNPERIOD_COOLDOWNPERIOD_Pos) /*!<
                                                                            Bit mask of COOLDOWNPERIOD field.*/


/* TRNG_RNGCONTROL_AUTOCORRTESTCUTOFF0: AutoCorrTestCutoff register 0 */
  #define TRNG_RNGCONTROL_AUTOCORRTESTCUTOFF0_ResetValue (0x007F007FUL) /*!< Reset value of AUTOCORRTESTCUTOFF0 register.      */

/* DLYZEROCUTOFF @Bits 0..15 : Auto-correlation test cut-off value for delay of 0 samples. */
  #define TRNG_RNGCONTROL_AUTOCORRTESTCUTOFF0_DLYZEROCUTOFF_Pos (0UL) /*!< Position of DLYZEROCUTOFF field.                    */
  #define TRNG_RNGCONTROL_AUTOCORRTESTCUTOFF0_DLYZEROCUTOFF_Msk (0xFFFFUL << TRNG_RNGCONTROL_AUTOCORRTESTCUTOFF0_DLYZEROCUTOFF_Pos)
                                                                            /*!< Bit mask of DLYZEROCUTOFF field.*/

/* DLYONECUTOFF @Bits 16..31 : Auto-correlation test cut-off value for delay of +1 sample. */
  #define TRNG_RNGCONTROL_AUTOCORRTESTCUTOFF0_DLYONECUTOFF_Pos (16UL) /*!< Position of DLYONECUTOFF field.                     */
  #define TRNG_RNGCONTROL_AUTOCORRTESTCUTOFF0_DLYONECUTOFF_Msk (0xFFFFUL << TRNG_RNGCONTROL_AUTOCORRTESTCUTOFF0_DLYONECUTOFF_Pos)
                                                                            /*!< Bit mask of DLYONECUTOFF field.*/


/* TRNG_RNGCONTROL_AUTOCORRTESTCUTOFF1: AutoCorrTestCutoff register 1 */
  #define TRNG_RNGCONTROL_AUTOCORRTESTCUTOFF1_ResetValue (0x007F007FUL) /*!< Reset value of AUTOCORRTESTCUTOFF1 register.      */

/* DLYTWOCUTOFF @Bits 0..15 : Auto-correlation test cut-off value for delay of +2 samples. */
  #define TRNG_RNGCONTROL_AUTOCORRTESTCUTOFF1_DLYTWOCUTOFF_Pos (0UL) /*!< Position of DLYTWOCUTOFF field.                      */
  #define TRNG_RNGCONTROL_AUTOCORRTESTCUTOFF1_DLYTWOCUTOFF_Msk (0xFFFFUL << TRNG_RNGCONTROL_AUTOCORRTESTCUTOFF1_DLYTWOCUTOFF_Pos)
                                                                            /*!< Bit mask of DLYTWOCUTOFF field.*/

/* DLYTHREECUTOFF @Bits 16..31 : Auto-correlation test cut-off value for delay of +3 samples. */
  #define TRNG_RNGCONTROL_AUTOCORRTESTCUTOFF1_DLYTHREECUTOFF_Pos (16UL) /*!< Position of DLYTHREECUTOFF field.                 */
  #define TRNG_RNGCONTROL_AUTOCORRTESTCUTOFF1_DLYTHREECUTOFF_Msk (0xFFFFUL << TRNG_RNGCONTROL_AUTOCORRTESTCUTOFF1_DLYTHREECUTOFF_Pos)
                                                                            /*!< Bit mask of DLYTHREECUTOFF field.*/


