NordicSemiconductor/nrfx/mdk/nrf54ls05b_enga_types.h
/* TRNG_RNGCONTROL_CORRTESTCUTOFF0: CorrTestCutoff register 0 */
  #define TRNG_RNGCONTROL_CORRTESTCUTOFF0_ResetValue (0x007F007FUL) /*!< Reset value of CORRTESTCUTOFF0 register.              */

/* DLYZEROCUTOFF @Bits 0..15 : Correlation test cut-off value for delay of 0 samples. */
  #define TRNG_RNGCONTROL_CORRTESTCUTOFF0_DLYZEROCUTOFF_Pos (0UL) /*!< Position of DLYZEROCUTOFF field.                        */
  #define TRNG_RNGCONTROL_CORRTESTCUTOFF0_DLYZEROCUTOFF_Msk (0xFFFFUL << TRNG_RNGCONTROL_CORRTESTCUTOFF0_DLYZEROCUTOFF_Pos) /*!<
                                                                            Bit mask of DLYZEROCUTOFF field.*/

/* DLYONECUTOFF @Bits 16..31 : Correlation test cut-off value for delay of +/-1 sample. */
  #define TRNG_RNGCONTROL_CORRTESTCUTOFF0_DLYONECUTOFF_Pos (16UL) /*!< Position of DLYONECUTOFF field.                         */
  #define TRNG_RNGCONTROL_CORRTESTCUTOFF0_DLYONECUTOFF_Msk (0xFFFFUL << TRNG_RNGCONTROL_CORRTESTCUTOFF0_DLYONECUTOFF_Pos) /*!<
                                                                            Bit mask of DLYONECUTOFF field.*/


/* TRNG_RNGCONTROL_CORRTESTCUTOFF1: CorrTestCutoff register 1 */
  #define TRNG_RNGCONTROL_CORRTESTCUTOFF1_ResetValue (0x007F007FUL) /*!< Reset value of CORRTESTCUTOFF1 register.              */

/* DLYTWOCUTOFF @Bits 0..15 : Correlation test cut-off value for delay of +/- 2 samples. */
  #define TRNG_RNGCONTROL_CORRTESTCUTOFF1_DLYTWOCUTOFF_Pos (0UL) /*!< Position of DLYTWOCUTOFF field.                          */
  #define TRNG_RNGCONTROL_CORRTESTCUTOFF1_DLYTWOCUTOFF_Msk (0xFFFFUL << TRNG_RNGCONTROL_CORRTESTCUTOFF1_DLYTWOCUTOFF_Pos) /*!<
                                                                            Bit mask of DLYTWOCUTOFF field.*/

/* DLYTHREECUTOFF @Bits 16..31 : Correlation test cut-off value for delay of +/- 3 samples. */
  #define TRNG_RNGCONTROL_CORRTESTCUTOFF1_DLYTHREECUTOFF_Pos (16UL) /*!< Position of DLYTHREECUTOFF field.                     */
  #define TRNG_RNGCONTROL_CORRTESTCUTOFF1_DLYTHREECUTOFF_Msk (0xFFFFUL << TRNG_RNGCONTROL_CORRTESTCUTOFF1_DLYTHREECUTOFF_Pos)
                                                                            /*!< Bit mask of DLYTHREECUTOFF field.*/


/* TRNG_RNGCONTROL_AUTOCORRTESTFAILED: Auto-correlation test failing ring(s). */
  #define TRNG_RNGCONTROL_AUTOCORRTESTFAILED_ResetValue (0x00000000UL) /*!< Reset value of AUTOCORRTESTFAILED register.        */

/* AUTOCORRTESTFAILED @Bits 0..31 : Auto-correlation test failing ring(s). */
  #define TRNG_RNGCONTROL_AUTOCORRTESTFAILED_AUTOCORRTESTFAILED_Pos (0UL) /*!< Position of AUTOCORRTESTFAILED field.           */
  #define TRNG_RNGCONTROL_AUTOCORRTESTFAILED_AUTOCORRTESTFAILED_Msk (0xFFFFFFFFUL << TRNG_RNGCONTROL_AUTOCORRTESTFAILED_AUTOCORRTESTFAILED_Pos)
                                                                            /*!< Bit mask of AUTOCORRTESTFAILED field.*/


/* TRNG_RNGCONTROL_CORRTESTFAILED: Correlation test failing ring. */
  #define TRNG_RNGCONTROL_CORRTESTFAILED_ResetValue (0x00000000UL) /*!< Reset value of CORRTESTFAILED register.                */

/* CORRTESTFAILED @Bits 0..31 : Correlation test failing ring. */
  #define TRNG_RNGCONTROL_CORRTESTFAILED_CORRTESTFAILED_Pos (0UL) /*!< Position of CORRTESTFAILED field.                       */
  #define TRNG_RNGCONTROL_CORRTESTFAILED_CORRTESTFAILED_Msk (0xFFFFFFFFUL << TRNG_RNGCONTROL_CORRTESTFAILED_CORRTESTFAILED_Pos)
                                                                            /*!< Bit mask of CORRTESTFAILED field.*/


/* TRNG_RNGCONTROL_HWVERSION: Fixed to 1 for this version. */
  #define TRNG_RNGCONTROL_HWVERSION_ResetValue (0x00000001UL) /*!< Reset value of HWVERSION register.                          */

/* HWVERSION @Bits 0..31 : Fixed to 1 for this version. */
  #define TRNG_RNGCONTROL_HWVERSION_HWVERSION_Pos (0UL) /*!< Position of HWVERSION field.                                      */
  #define TRNG_RNGCONTROL_HWVERSION_HWVERSION_Msk (0xFFFFFFFFUL << TRNG_RNGCONTROL_HWVERSION_HWVERSION_Pos) /*!< Bit mask of
                                                                            HWVERSION field.*/


/* TRNG_RNGCONTROL_FIFO: FIFO data */
  #define TRNG_RNGCONTROL_FIFO_MaxCount (32UL)       /*!< Max size of FIFO[32] array.                                          */
  #define TRNG_RNGCONTROL_FIFO_MaxIndex (31UL)       /*!< Max index of FIFO[32] array.                                         */
  #define TRNG_RNGCONTROL_FIFO_MinIndex (0UL)        /*!< Min index of FIFO[32] array.                                         */
  #define TRNG_RNGCONTROL_FIFO_ResetValue (0x00000000UL) /*!< Reset value of FIFO[32] register.                                */

/* DATA @Bits 0..31 : FIFO data */
  #define TRNG_RNGCONTROL_FIFO_DATA_Pos (0UL)        /*!< Position of DATA field.                                              */
  #define TRNG_RNGCONTROL_FIFO_DATA_Msk (0xFFFFFFFFUL << TRNG_RNGCONTROL_FIFO_DATA_Pos) /*!< Bit mask of DATA field.           */


/* ======================================================= Struct TRNG ======================================================= */
/**
  * @brief TRNG
  */
  typedef struct {                                   /*!< TRNG Structure                                                       */
    __IM uint32_t RESERVED[65];
    __IOM uint32_t EVENTS_RNG;                       /*!< (@ 0x00000104) Event indicating that interrupt triggered at RNG      */
    __IM uint32_t RESERVED1[126];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000400) Enable RNG peripheral module.                         */
    __IM uint32_t RESERVED3[63];
    __IOM NRF_TRNG_RNGCONTROL_Type RNGCONTROL;       /*!< (@ 0x00000500) (unspecified)                                         */
  } NRF_TRNG_Type;                                   /*!< Size = 1536 (0x600)                                                  */

/* TRNG_EVENTS_RNG: Event indicating that interrupt triggered at RNG */
  #define TRNG_EVENTS_RNG_ResetValue (0x00000000UL)  /*!< Reset value of EVENTS_RNG register.                                  */

/* EVENTS_RNG @Bit 0 : Event indicating that interrupt triggered at RNG */
  #define TRNG_EVENTS_RNG_EVENTS_RNG_Pos (0UL)       /*!< Position of EVENTS_RNG field.                                        */
  #define TRNG_EVENTS_RNG_EVENTS_RNG_Msk (0x1UL << TRNG_EVENTS_RNG_EVENTS_RNG_Pos) /*!< Bit mask of EVENTS_RNG field.          */
  #define TRNG_EVENTS_RNG_EVENTS_RNG_Min (0x0UL)     /*!< Min enumerator value of EVENTS_RNG field.                            */
  #define TRNG_EVENTS_RNG_EVENTS_RNG_Max (0x1UL)     /*!< Max enumerator value of EVENTS_RNG field.                            */
  #define TRNG_EVENTS_RNG_EVENTS_RNG_NotGenerated (0x0UL) /*!< Event not generated                                             */
  #define TRNG_EVENTS_RNG_EVENTS_RNG_Generated (0x1UL) /*!< Event generated                                                    */


/* TRNG_INTEN: Enable or disable interrupt */
  #define TRNG_INTEN_ResetValue (0x00000000UL)       /*!< Reset value of INTEN register.                                       */

/* RNG @Bit 1 : Enable or disable interrupt for event RNG */
  #define TRNG_INTEN_RNG_Pos (1UL)                   /*!< Position of RNG field.                                               */
  #define TRNG_INTEN_RNG_Msk (0x1UL << TRNG_INTEN_RNG_Pos) /*!< Bit mask of RNG field.                                         */
  #define TRNG_INTEN_RNG_Min (0x0UL)                 /*!< Min enumerator value of RNG field.                                   */
  #define TRNG_INTEN_RNG_Max (0x1UL)                 /*!< Max enumerator value of RNG field.                                   */
  #define TRNG_INTEN_RNG_Disabled (0x0UL)            /*!< Disable                                                              */
  #define TRNG_INTEN_RNG_Enabled (0x1UL)             /*!< Enable                                                               */


/* TRNG_INTENSET: Enable interrupt */
  #define TRNG_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

