NordicSemiconductor/nrfx/mdk/nrf54ls05b_enga_types.h
/* RNG @Bit 1 : Write '1' to enable interrupt for event RNG */
  #define TRNG_INTENSET_RNG_Pos (1UL)                /*!< Position of RNG field.                                               */
  #define TRNG_INTENSET_RNG_Msk (0x1UL << TRNG_INTENSET_RNG_Pos) /*!< Bit mask of RNG field.                                   */
  #define TRNG_INTENSET_RNG_Min (0x0UL)              /*!< Min enumerator value of RNG field.                                   */
  #define TRNG_INTENSET_RNG_Max (0x1UL)              /*!< Max enumerator value of RNG field.                                   */
  #define TRNG_INTENSET_RNG_Set (0x1UL)              /*!< Enable                                                               */
  #define TRNG_INTENSET_RNG_Disabled (0x0UL)         /*!< Read: Disabled                                                       */
  #define TRNG_INTENSET_RNG_Enabled (0x1UL)          /*!< Read: Enabled                                                        */


/* TRNG_INTENCLR: Disable interrupt */
  #define TRNG_INTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of INTENCLR register.                                    */

/* RNG @Bit 1 : Write '1' to disable interrupt for event RNG */
  #define TRNG_INTENCLR_RNG_Pos (1UL)                /*!< Position of RNG field.                                               */
  #define TRNG_INTENCLR_RNG_Msk (0x1UL << TRNG_INTENCLR_RNG_Pos) /*!< Bit mask of RNG field.                                   */
  #define TRNG_INTENCLR_RNG_Min (0x0UL)              /*!< Min enumerator value of RNG field.                                   */
  #define TRNG_INTENCLR_RNG_Max (0x1UL)              /*!< Max enumerator value of RNG field.                                   */
  #define TRNG_INTENCLR_RNG_Clear (0x1UL)            /*!< Disable                                                              */
  #define TRNG_INTENCLR_RNG_Disabled (0x0UL)         /*!< Read: Disabled                                                       */
  #define TRNG_INTENCLR_RNG_Enabled (0x1UL)          /*!< Read: Enabled                                                        */


/* TRNG_INTPEND: Pending interrupts */
  #define TRNG_INTPEND_ResetValue (0x00000000UL)     /*!< Reset value of INTPEND register.                                     */

/* RNG @Bit 1 : Read pending status of interrupt for event RNG */
  #define TRNG_INTPEND_RNG_Pos (1UL)                 /*!< Position of RNG field.                                               */
  #define TRNG_INTPEND_RNG_Msk (0x1UL << TRNG_INTPEND_RNG_Pos) /*!< Bit mask of RNG field.                                     */
  #define TRNG_INTPEND_RNG_Min (0x0UL)               /*!< Min enumerator value of RNG field.                                   */
  #define TRNG_INTPEND_RNG_Max (0x1UL)               /*!< Max enumerator value of RNG field.                                   */
  #define TRNG_INTPEND_RNG_NotPending (0x0UL)        /*!< Read: Not pending                                                    */
  #define TRNG_INTPEND_RNG_Pending (0x1UL)           /*!< Read: Pending                                                        */


/* TRNG_ENABLE: Enable RNG peripheral module. */
  #define TRNG_ENABLE_ResetValue (0x00000000UL)      /*!< Reset value of ENABLE register.                                      */

/* RNG @Bit 1 : Enable RNG */
  #define TRNG_ENABLE_RNG_Pos (1UL)                  /*!< Position of RNG field.                                               */
  #define TRNG_ENABLE_RNG_Msk (0x1UL << TRNG_ENABLE_RNG_Pos) /*!< Bit mask of RNG field.                                       */
  #define TRNG_ENABLE_RNG_Min (0x0UL)                /*!< Min enumerator value of RNG field.                                   */
  #define TRNG_ENABLE_RNG_Max (0x1UL)                /*!< Max enumerator value of RNG field.                                   */
  #define TRNG_ENABLE_RNG_Disabled (0x0UL)           /*!< RNG disabled.                                                        */
  #define TRNG_ENABLE_RNG_Enabled (0x1UL)            /*!< RNG enabled.                                                         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TWIM                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct TWIM_TASKS_DMA_RX ================================================= */
/**
  * @brief RX [TWIM_TASKS_DMA_RX] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  START;                             /*!< (@ 0x00000000) Starts operation using easyDMA to load the values. See
                                                                         peripheral description for operation using easyDMA.*/
  __OM  uint32_t  STOP;                              /*!< (@ 0x00000004) Stops operation using easyDMA. This does not trigger an
                                                                         END event.*/
  __OM  uint32_t  ENABLEMATCH[4];                    /*!< (@ 0x00000008) Enables the MATCH[n] event by setting the ENABLE[n] bit
                                                                         in the CONFIG register.*/
  __OM  uint32_t  DISABLEMATCH[4];                   /*!< (@ 0x00000018) Disables the MATCH[n] event by clearing the ENABLE[n]
                                                                         bit in the CONFIG register.*/
} NRF_TWIM_TASKS_DMA_RX_Type;                        /*!< Size = 40 (0x028)                                                    */

