NordicSemiconductor/nrfx/mdk/nrf54ls05b_enga_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define UARTE_SUBSCRIBE_DMA_TX_START_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                           */
  #define UARTE_SUBSCRIBE_DMA_TX_START_CHIDX_Msk (0xFFUL << UARTE_SUBSCRIBE_DMA_TX_START_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define UARTE_SUBSCRIBE_DMA_TX_START_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                       */
  #define UARTE_SUBSCRIBE_DMA_TX_START_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                        */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_SUBSCRIBE_DMA_TX_START_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define UARTE_SUBSCRIBE_DMA_TX_START_EN_Msk (0x1UL << UARTE_SUBSCRIBE_DMA_TX_START_EN_Pos) /*!< Bit mask of EN field.        */
  #define UARTE_SUBSCRIBE_DMA_TX_START_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define UARTE_SUBSCRIBE_DMA_TX_START_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define UARTE_SUBSCRIBE_DMA_TX_START_EN_Disabled (0x0UL) /*!< Disable subscription                                           */
  #define UARTE_SUBSCRIBE_DMA_TX_START_EN_Enabled (0x1UL) /*!< Enable subscription                                             */


/* UARTE_SUBSCRIBE_DMA_TX_STOP: Subscribe configuration for task STOP */
  #define UARTE_SUBSCRIBE_DMA_TX_STOP_ResetValue (0x00000000UL) /*!< Reset value of STOP register.                             */

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define UARTE_SUBSCRIBE_DMA_TX_STOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define UARTE_SUBSCRIBE_DMA_TX_STOP_CHIDX_Msk (0xFFUL << UARTE_SUBSCRIBE_DMA_TX_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define UARTE_SUBSCRIBE_DMA_TX_STOP_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                        */
  #define UARTE_SUBSCRIBE_DMA_TX_STOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_SUBSCRIBE_DMA_TX_STOP_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define UARTE_SUBSCRIBE_DMA_TX_STOP_EN_Msk (0x1UL << UARTE_SUBSCRIBE_DMA_TX_STOP_EN_Pos) /*!< Bit mask of EN field.          */
  #define UARTE_SUBSCRIBE_DMA_TX_STOP_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define UARTE_SUBSCRIBE_DMA_TX_STOP_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define UARTE_SUBSCRIBE_DMA_TX_STOP_EN_Disabled (0x0UL) /*!< Disable subscription                                            */
  #define UARTE_SUBSCRIBE_DMA_TX_STOP_EN_Enabled (0x1UL) /*!< Enable subscription                                              */



/* =============================================== Struct UARTE_SUBSCRIBE_DMA ================================================ */
/**
  * @brief SUBSCRIBE_DMA [UARTE_SUBSCRIBE_DMA] Subscribe configuration for tasks
  */
typedef struct {
  __IOM NRF_UARTE_SUBSCRIBE_DMA_RX_Type RX;          /*!< (@ 0x00000000) Subscribe configuration for tasks                     */
  __IOM NRF_UARTE_SUBSCRIBE_DMA_TX_Type TX;          /*!< (@ 0x00000028) Subscribe configuration for tasks                     */
} NRF_UARTE_SUBSCRIBE_DMA_Type;                      /*!< Size = 48 (0x030)                                                    */


/* =============================================== Struct UARTE_EVENTS_DMA_RX ================================================ */
/**
  * @brief RX [UARTE_EVENTS_DMA_RX] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  END;                               /*!< (@ 0x00000000) Generated after all MAXCNT bytes have been transferred*/
  __IOM uint32_t  READY;                             /*!< (@ 0x00000004) Generated when EasyDMA has buffered the .PTR and
                                                                         .MAXCNT registers for the channel, allowing them to be
                                                                         written to prepare for the next sequence.*/
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000008) An error occured during the bus transfer.             */
  __IOM uint32_t  MATCH[4];                          /*!< (@ 0x0000000C) Pattern match is detected on the DMA data bus.        */
} NRF_UARTE_EVENTS_DMA_RX_Type;                      /*!< Size = 28 (0x01C)                                                    */

/* UARTE_EVENTS_DMA_RX_END: Generated after all MAXCNT bytes have been transferred */
  #define UARTE_EVENTS_DMA_RX_END_ResetValue (0x00000000UL) /*!< Reset value of END register.                                  */

/* END @Bit 0 : Generated after all MAXCNT bytes have been transferred */
  #define UARTE_EVENTS_DMA_RX_END_END_Pos (0UL)      /*!< Position of END field.                                               */
  #define UARTE_EVENTS_DMA_RX_END_END_Msk (0x1UL << UARTE_EVENTS_DMA_RX_END_END_Pos) /*!< Bit mask of END field.               */
  #define UARTE_EVENTS_DMA_RX_END_END_Min (0x0UL)    /*!< Min enumerator value of END field.                                   */
  #define UARTE_EVENTS_DMA_RX_END_END_Max (0x1UL)    /*!< Max enumerator value of END field.                                   */
  #define UARTE_EVENTS_DMA_RX_END_END_NotGenerated (0x0UL) /*!< Event not generated                                            */
  #define UARTE_EVENTS_DMA_RX_END_END_Generated (0x1UL) /*!< Event generated                                                   */


/* UARTE_EVENTS_DMA_RX_READY: Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them
                               to be written to prepare for the next sequence. */

