NordicSemiconductor/nrfx/mdk/nrf54ls05b_enga_types.h
/* WRITEONCE @Bit 12 : Write-once */
  #define UICR_BOOTCONF_WRITEONCE_Pos (12UL)         /*!< Position of WRITEONCE field.                                         */
  #define UICR_BOOTCONF_WRITEONCE_Msk (0x1UL << UICR_BOOTCONF_WRITEONCE_Pos) /*!< Bit mask of WRITEONCE field.                 */
  #define UICR_BOOTCONF_WRITEONCE_Min (0x0UL)        /*!< Min enumerator value of WRITEONCE field.                             */
  #define UICR_BOOTCONF_WRITEONCE_Max (0x1UL)        /*!< Max enumerator value of WRITEONCE field.                             */
  #define UICR_BOOTCONF_WRITEONCE_Disabled (0x0UL)   /*!< Write-once disabled                                                  */
  #define UICR_BOOTCONF_WRITEONCE_Enabled (0x1UL)    /*!< Write-once enabled                                                   */

/* LOCK @Bit 13 : Enable lock of configuration register */
  #define UICR_BOOTCONF_LOCK_Pos (13UL)              /*!< Position of LOCK field.                                              */
  #define UICR_BOOTCONF_LOCK_Msk (0x1UL << UICR_BOOTCONF_LOCK_Pos) /*!< Bit mask of LOCK field.                                */
  #define UICR_BOOTCONF_LOCK_Min (0x0UL)             /*!< Min enumerator value of LOCK field.                                  */
  #define UICR_BOOTCONF_LOCK_Max (0x1UL)             /*!< Max enumerator value of LOCK field.                                  */
  #define UICR_BOOTCONF_LOCK_Disabled (0x0UL)        /*!< Lock is disabled, and the RRAMC region configuration registers for the
                                                          immutable boot region are writable.*/
  #define UICR_BOOTCONF_LOCK_Enabled (0x1UL)         /*!< Lock is enabled, and the RRAMC configuration registers for the
                                                          immutable boot region are read-only.*/

/* SIZE @Bits 16..20 : Immutable boot region size */
  #define UICR_BOOTCONF_SIZE_Pos (16UL)              /*!< Position of SIZE field.                                              */
  #define UICR_BOOTCONF_SIZE_Msk (0x1FUL << UICR_BOOTCONF_SIZE_Pos) /*!< Bit mask of SIZE field.                               */


/* UICR_OTP: One time programmable memory */
  #define UICR_OTP_MaxCount (320UL)                  /*!< Max size of OTP[320] array.                                          */
  #define UICR_OTP_MaxIndex (319UL)                  /*!< Max index of OTP[320] array.                                         */
  #define UICR_OTP_MinIndex (0UL)                    /*!< Min index of OTP[320] array.                                         */
  #define UICR_OTP_ResetValue (0xFFFFFFFFUL)         /*!< Reset value of OTP[320] register.                                    */

/* OTP @Bits 0..31 : OTP word */
  #define UICR_OTP_OTP_Pos (0UL)                     /*!< Position of OTP field.                                               */
  #define UICR_OTP_OTP_Msk (0xFFFFFFFFUL << UICR_OTP_OTP_Pos) /*!< Bit mask of OTP field.                                      */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                      VDMADESCRIPTOR                                      ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ================================================== Struct VDMADESCRIPTOR ================================================== */
/**
  * @brief Job descriptor for vector-based DMA.
  */
  typedef struct {                                   /*!< VDMADESCRIPTOR Structure                                             */
    __IOM uint32_t PTR;                              /*!< (@ 0x00000000) Pointer to data buffer.                               */
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000004) Job configuration. Configuration of attributes and
                                                                         buffer length.*/
  } NRF_VDMADESCRIPTOR_Type;                         /*!< Size = 8 (0x008)                                                     */

/* VDMADESCRIPTOR_PTR: Pointer to data buffer. */
  #define VDMADESCRIPTOR_PTR_ResetValue (0x00000000UL) /*!< Reset value of PTR register.                                       */

/* PTR @Bits 0..31 : Pointer to data buffer. */
  #define VDMADESCRIPTOR_PTR_PTR_Pos (0UL)           /*!< Position of PTR field.                                               */
  #define VDMADESCRIPTOR_PTR_PTR_Msk (0xFFFFFFFFUL << VDMADESCRIPTOR_PTR_PTR_Pos) /*!< Bit mask of PTR field.                  */


/* VDMADESCRIPTOR_CONFIG: Job configuration. Configuration of attributes and buffer length. */
  #define VDMADESCRIPTOR_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                                 */

/* CNT @Bits 0..23 : Maximum number of bytes in data buffer. */
  #define VDMADESCRIPTOR_CONFIG_CNT_Pos (0UL)        /*!< Position of CNT field.                                               */
  #define VDMADESCRIPTOR_CONFIG_CNT_Msk (0xFFFFFFUL << VDMADESCRIPTOR_CONFIG_CNT_Pos) /*!< Bit mask of CNT field.              */

/* ATTRIBUTE @Bits 24..29 : Job attribute. */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Pos (24UL) /*!< Position of ATTRIBUTE field.                                         */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Msk (0x3FUL << VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Pos) /*!< Bit mask of ATTRIBUTE field.*/
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Min (0xBUL) /*!< Min enumerator value of ATTRIBUTE field.                            */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Max (0xEUL) /*!< Max enumerator value of ATTRIBUTE field.                            */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_AarHash (0x0BUL) /*!< Hash attribute                                                 */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_AarPrand (0x0CUL) /*!< Prand attribute                                               */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_AarIrk (0x0DUL) /*!< Irk attribute                                                   */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_CcmAlen (0x0BUL) /*!< Alen attribute                                                 */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_CcmMlen (0x0CUL) /*!< Mlen attribute                                                 */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_CcmAdata (0x0DUL) /*!< Adata attribute                                               */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_CcmMdata (0x0EUL) /*!< Mdata attribute                                               */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_EcbData (0x0BUL) /*!< EcbData attribute                                              */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            WDT                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct WDT ======================================================== */
/**
  * @brief Watchdog Timer
  */
  typedef struct {                                   /*!< WDT Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start WDT                                             */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop WDT                                              */
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t EVENTS_TIMEOUT;                   /*!< (@ 0x00000100) Watchdog timeout                                      */
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000104) Watchdog stopped                                      */
    __IM uint32_t RESERVED2[30];
    __IOM uint32_t PUBLISH_TIMEOUT;                  /*!< (@ 0x00000180) Publish configuration for event TIMEOUT               */
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000184) Publish configuration for event STOPPED               */
    __IM uint32_t RESERVED3[95];
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED4[6];
    __IOM uint32_t NMIENSET;                         /*!< (@ 0x00000324) Enable interrupt                                      */
    __IOM uint32_t NMIENCLR;                         /*!< (@ 0x00000328) Disable interrupt                                     */
    __IM uint32_t RESERVED5[53];
    __IM uint32_t RUNSTATUS;                         /*!< (@ 0x00000400) Run status                                            */
    __IM uint32_t REQSTATUS;                         /*!< (@ 0x00000404) Request status                                        */
    __IM uint32_t RESERVED6[63];
    __IOM uint32_t CRV;                              /*!< (@ 0x00000504) Counter reload value                                  */
    __IOM uint32_t RREN;                             /*!< (@ 0x00000508) Enable register for reload request registers          */
    __IOM uint32_t CONFIG;                           /*!< (@ 0x0000050C) Configuration register                                */
    __IM uint32_t RESERVED7[4];
    __OM uint32_t TSEN;                              /*!< (@ 0x00000520) Task stop enable                                      */
    __IM uint32_t RESERVED8[55];
    __OM uint32_t RR[8];                             /*!< (@ 0x00000600) Reload request n                                      */
  } NRF_WDT_Type;                                    /*!< Size = 1568 (0x620)                                                  */

